.src/163/SQLServer/b-sql.org
#+TITLE: SQL 语句


* SQL 是什么
:PROPERTIES:
:ID:       305f22db-1d25-4095-8fe0-599b14d50819
:END:

Structured Query Language, 结构化查询语言。

它是操作[[file:../roam/20200826034745-关系型数据库.org][关系型数据]]的标准语言。

发展简史:
- 1976 左右，IBM 发表了想法
- 1979 左右，Oracle 给出了实现
- 1990 左右，SQL 成了工业标准

* SQL 的分类
** DDL (Data Definition Language) 数据定义语言

用来对数据的对象进行定义的一些语句:
- 创建: ~create 类型 名字 详细定义~ 例: ~create table xxx ()~
- 修改: ~alter 类型 名字 你要修改的东西~ 例: ~alter table xxx add column (yyy int)~
- 删掉: ~drop 类型 名字~ 例: ~drop table xxx~

** DML (Data Manipulation Language) 数据操纵语言

对数据的操作:
- 增(C): ~insert into~
- 删(D): ~delete from~
- 改(U): ~update~
- 查(R): ~select from~  *-*-

** DCL (Data Control Language) 数据控制语言

- 授予权限: ~grant to~
- 撤回权限: ~revoke from~

** TCL (Transaction Control Language) 事务控制语言

- 设置保存点: ~savepoint xxx~
- 撤回: ~rollback [xxx]~
- 提交: ~commit~

* SQLServer 中的 SQL 语句
** database 的创建和删除

最基本的创建语句:
#+begin_src sql
  create database demo;
  go
#+end_src

带各种参数的创建语句:
#+begin_src sql
  create database school
  on
  (
     name = school,                   -- 主数据文件的逻辑名称
     filename = 'd:\data\school.mdf', -- 主数据文件数据保存的位置
     size = 10,                       -- 主数据文件的初始化大小为 10M
     maxsize = 500,                   -- 主数据文件的最大值为 500M
     filegrowth = 10%                 -- 主数据文件的增长策略
  )
  log on
  (
     name = school_log,                   -- 日志文件的逻辑名字
     filename = 'd:\data\school_log.ldf', -- 日志文件的保存位置
     size = 10,
     maxsize = 100,
     filegrowth = 2
  );
  go
#+end_src

删除的语句:
#+begin_src sql
  drop database school;
  drop database home;
  drop database demo;
#+end_src

