html/SQLServer/b-sql.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>SQL 语句</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliusan/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">SQL 语句</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf8dd469">1. SQL 是什么</a></li>
<li><a href="#org7785d59">2. SQL 的分类</a>
<ul>
<li><a href="#org3d8224c">2.1. DDL (Data Definition Language) 数据定义语言</a></li>
<li><a href="#orgf66a1a8">2.2. DML (Data Manipulation Language) 数据操纵语言</a></li>
<li><a href="#orge6b1e17">2.3. DCL (Data Control Language) 数据控制语言</a></li>
<li><a href="#orgd1f34b3">2.4. TCL (Transaction Control Language) 事务控制语言</a></li>
</ul>
</li>
<li><a href="#orgad9c6b3">3. SQLServer 中的 SQL 语句</a>
<ul>
<li><a href="#org3d8a7bf">3.1. database 的创建和删除</a></li>
<li><a href="#orgc9118f7">3.2. table 的创建</a></li>
<li><a href="#orgc034ae3">3.3. 常见数据类型</a>
<ul>
<li><a href="#org729861d">3.3.1. 数值</a></li>
<li><a href="#org67411c3">3.3.2. 字符串</a></li>
<li><a href="#orgdaee19c">3.3.3. 日期/时间</a></li>
<li><a href="#org5c1f978">3.3.4. 其他类型</a></li>
<li><a href="#org3a81d6d">3.3.5. 使用例子</a></li>
</ul>
</li>
<li><a href="#org720a383">3.4. table 的修改</a></li>
<li><a href="#org877b2eb">3.5. table 的删除</a></li>
<li><a href="#orgf46e263">3.6. constraint 的管理</a></li>
<li><a href="#orged456e4">3.7. insert 插入</a></li>
<li><a href="#orgc74556d">3.8. delete/truncate 删除</a></li>
<li><a href="#org92f5321">3.9. update 更新</a></li>
<li><a href="#org3efb8f5">3.10. select 查询</a>
<ul>
<li><a href="#orgc8463eb">3.10.1. 测试数据</a></li>
<li><a href="#orgd6e70bf">3.10.2. 基本查询</a></li>
<li><a href="#org29881c2">3.10.3. 子查询 (subquery)</a>
<ul>
<li><a href="#org87076c8">3.10.3.1. 作为临时表存在</a></li>
<li><a href="#org65a4a8f">3.10.3.2. 作为字段存在</a></li>
<li><a href="#org0d52b07">3.10.3.3. 作为条件存在</a></li>
<li><a href="#org608f6a7">3.10.3.4. 阶段性作业 (subquery)</a></li>
</ul>
</li>
<li><a href="#org01b2625">3.10.4. 连接查询 (join)</a></li>
<li><a href="#org218a752">3.10.5. 合并 (union)</a></li>
<li><a href="#org6e82e17">3.10.6. 分组、窗口查询 (group by/over)</a></li>
<li><a href="#orge2b8533">3.10.7. 分页查询 (top/row_number/fetch-offset)</a></li>
</ul>
</li>
<li><a href="#org1e8cf5e">3.11. Transaction 事务</a>
<ul>
<li><a href="#orge1f76bd">3.11.1. 什么是事务 (ACID)</a></li>
<li><a href="#orgfcae39c">3.11.2. 事务的状态</a></li>
<li><a href="#orge19d094">3.11.3. SQLServer 中的事务</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd10ac06">4. MySQL 中的 SQL 语句</a>
<ul>
<li><a href="#orgf78308e">4.1. create</a></li>
<li><a href="#orgc4d55d6">4.2. 分页</a></li>
</ul>
</li>
</ul>
</div>
</nav>


<section id="outline-container-orgf8dd469" class="outline-2">
<h2 id="orgf8dd469"><span class="section-number-2">1</span> SQL 是什么</h2>
<div class="outline-text-2" id="text-1">
<p>
Structured Query Language, 结构化查询语言。
</p>

<p>
它是操作<a href="../roam/20200826034745-关系型数据库.html">关系型数据</a>的标准语言。
</p>

<p>
发展简史:
</p>
<ul class="org-ul">
<li>1976 左右，IBM 发表了想法</li>
<li>1979 左右，Oracle 给出了实现</li>
<li>1990 左右，SQL 成了工业标准</li>
</ul>
</div>
</section>

<section id="outline-container-org7785d59" class="outline-2">
<h2 id="org7785d59"><span class="section-number-2">2</span> SQL 的分类</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org3d8224c" class="outline-3">
<h3 id="org3d8224c"><span class="section-number-3">2.1</span> DDL (Data Definition Language) 数据定义语言</h3>
<div class="outline-text-3" id="text-2-1">
<p>
用来对数据的对象进行定义的一些语句:
</p>
<ul class="org-ul">
<li>创建: <code>create 类型 名字 详细定义</code> 例: <code>create table xxx ()</code></li>
<li>修改: <code>alter 类型 名字 你要修改的东西</code> 例: <code>alter table xxx add column (yyy int)</code></li>
<li>删掉: <code>drop 类型 名字</code> 例: <code>drop table xxx</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgf66a1a8" class="outline-3">
<h3 id="orgf66a1a8"><span class="section-number-3">2.2</span> DML (Data Manipulation Language) 数据操纵语言</h3>
<div class="outline-text-3" id="text-2-2">
<p>
对数据的操作:
</p>
<ul class="org-ul">
<li>增(C): <code>insert into</code></li>
<li>删(D): <code>delete from</code></li>
<li>改(U): <code>update</code></li>
<li>查(R): <code>select from</code>  <b>-</b>-</li>
</ul>
</div>
</div>

<div id="outline-container-orge6b1e17" class="outline-3">
<h3 id="orge6b1e17"><span class="section-number-3">2.3</span> DCL (Data Control Language) 数据控制语言</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>授予权限: <code>grant to</code></li>
<li>撤回权限: <code>revoke from</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgd1f34b3" class="outline-3">
<h3 id="orgd1f34b3"><span class="section-number-3">2.4</span> TCL (Transaction Control Language) 事务控制语言</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>设置保存点: <code>savepoint xxx</code></li>
<li>撤回: <code>rollback [xxx]</code></li>
<li>提交: <code>commit</code></li>
</ul>
</div>
</div>
</section>

<section id="outline-container-orgad9c6b3" class="outline-2">
<h2 id="orgad9c6b3"><span class="section-number-2">3</span> SQLServer 中的 SQL 语句</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3d8a7bf" class="outline-3">
<h3 id="org3d8a7bf"><span class="section-number-3">3.1</span> database 的创建和删除</h3>
<div class="outline-text-3" id="text-3-1">
<p>
最基本的创建语句:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> database demo;
<span style="color: #c678dd; font-weight: bold;">go</span>
</pre>
</div>

<p>
带各种参数的创建语句:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> database school
<span style="color: #c678dd; font-weight: bold;">on</span>
<span style="color: #8c8c8c;">(</span>
   <span style="color: #c678dd; font-weight: bold;">name</span> = school,                   <span style="color: #687080; font-style: italic;">-- &#20027;&#25968;&#25454;&#25991;&#20214;&#30340;&#36923;&#36753;&#21517;&#31216;</span>
   filename = <span style="color: #98be65;">'d:\data\school.mdf'</span>, <span style="color: #687080; font-style: italic;">-- &#20027;&#25968;&#25454;&#25991;&#20214;&#25968;&#25454;&#20445;&#23384;&#30340;&#20301;&#32622;</span>
   <span style="color: #c678dd; font-weight: bold;">size</span> = 10,                       <span style="color: #687080; font-style: italic;">-- &#20027;&#25968;&#25454;&#25991;&#20214;&#30340;&#21021;&#22987;&#21270;&#22823;&#23567;&#20026; 10M</span>
   maxsize = 500,                   <span style="color: #687080; font-style: italic;">-- &#20027;&#25968;&#25454;&#25991;&#20214;&#30340;&#26368;&#22823;&#20540;&#20026; 500M</span>
   filegrowth = 10%                 <span style="color: #687080; font-style: italic;">-- &#20027;&#25968;&#25454;&#25991;&#20214;&#30340;&#22686;&#38271;&#31574;&#30053;</span>
<span style="color: #8c8c8c;">)</span>
log <span style="color: #c678dd; font-weight: bold;">on</span>
<span style="color: #8c8c8c;">(</span>
   <span style="color: #c678dd; font-weight: bold;">name</span> = school_log,                   <span style="color: #687080; font-style: italic;">-- &#26085;&#24535;&#25991;&#20214;&#30340;&#36923;&#36753;&#21517;&#23383;</span>
   filename = <span style="color: #98be65;">'d:\data\school_log.ldf'</span>, <span style="color: #687080; font-style: italic;">-- &#26085;&#24535;&#25991;&#20214;&#30340;&#20445;&#23384;&#20301;&#32622;</span>
   <span style="color: #c678dd; font-weight: bold;">size</span> = 10,
   maxsize = 100,
   filegrowth = 2
<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">go</span>
</pre>
</div>

<p>
删除的语句:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">drop</span> database school;
<span style="color: #c678dd; font-weight: bold;">drop</span> database home;
<span style="color: #c678dd; font-weight: bold;">drop</span> database demo;
</pre>
</div>
</div>
</div>
