.src/163/SQLServer/b-sql.org
** table 的创建

基本的创建示例:
#+begin_src sql
  use xxx;
  go
  create table room_type
  (
     type_number varchar(4) primary key,
     type_name varchar(40),
     pricE money,
     [coPrice] money,
     total_number decimal(3, 0) not null default 0
  );
  go
#+end_src

稍复杂一点的例子:
#+begin_src sql
  use xxx;
  go
  create table stuInfo
  (
     stuNo int identity primary key,         -- 主键+自增
     stuName varchar(12) not null,           -- 非空约束
     stuAge int                              -- 有问题!!!
       not null                              -- 非空约束
       check(stuAge >= 0 and stuAge <= 100), -- 检查约束
     stuSex nchar(1)
       not null                              -- 非空约束
       check(stuSex = '男' or stuSex = '女') -- 检查约束
       default ('男'),                       -- 默认值
     stuTel varchar(15),
     stuAddress varchar(50) default ('地址不详'),
     className varchar(12) not null
  );
  go
  create table exam
  (
    examNo int primary key identity(1, 1),
    stuNo int foreign key references stuInfo(stuNo),       -- 外键约束
    written float check (written >= 0 and written <= 100), -- 笔试
    lab float check (lab >= 0 and lab <= 100)              -- 机试
  );
  go
#+end_src

Question:
- char/nchar/varchar/nvarchar 类型的区别
  #+begin_src sql
    create table x (s char(1));
    create table y (s nchar(1));
    insert into y values ('男');
  #+end_src
- GBK/UTF8/UTF16 的区别
- 什么是外键，它有什么作用，是不是必须的? 外键有哪些添加方式?

小结:
- 默认情况下，字段的大小写不敏感，可以使用 ~[xxx]~ 方式强制其敏感
- 在数据库中，字段/表名字使用的是下划线分割的命名规则
- 数据应该是静态的，年龄 (Age) 不适合作为一个字段，用 birth 代替
- 建议使用 *代理主键* 代替 *自然主键*，即主键不应与业务有关
- 表跟列的命名，有不同风格:

  #+begin_src sql
    create table student (id, name, tel, addr);
    create table t_student (stu_id, stu_name, stu_tel, stu_addr);
  #+end_src

** 常见数据类型
*** 数值

整数:
- tinyint
- smallint
- int
- bigint

浮点:
- real
- float
- decimal(5,2)

另外:
- smallmoney
- money

*** 字符串

- char/nchar
- varchar/nvarchar，有存储上限的 8000
- text/ntext，表示巨大的存储

*** 日期/时间

- date
- time
- datetime
- datetime2
- getdate()

*** 其他类型

- image
- binary
- varbinary

*** 使用例子

#+begin_src sql
  use xxx;
  go
  create table xx13 (aaa datetime2 default getdate(), b int);
  insert into xx13 (b) values (1);
  go

  select * from xx13;
#+end_src

