html/SQLServer/b-sql.html

<div id="outline-container-orgc9118f7" class="outline-3">
<h3 id="orgc9118f7"><span class="section-number-3">3.2</span> table 的创建</h3>
<div class="outline-text-3" id="text-3-2">
<p>
基本的创建示例:
</p>
<div class="org-src-container">
<pre class="src src-sql">use xxx;
<span style="color: #c678dd; font-weight: bold;">go</span>
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">room_type</span>
<span style="color: #8c8c8c;">(</span>
   type_number <span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>4<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">primary</span> <span style="color: #c678dd; font-weight: bold;">key</span>,
   type_name <span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>40<span style="color: #93a8c6;">)</span>,
   pricE money,
   <span style="color: #93a8c6;">[</span>coPrice<span style="color: #93a8c6;">]</span> money,
   total_number <span style="color: #61afef;">decimal</span><span style="color: #93a8c6;">(</span>3, 0<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span> <span style="color: #c678dd; font-weight: bold;">default</span> 0
<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">go</span>
</pre>
</div>

<p>
稍复杂一点的例子:
</p>
<div class="org-src-container">
<pre class="src src-sql">use xxx;
<span style="color: #c678dd; font-weight: bold;">go</span>
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">stuInfo</span>
<span style="color: #8c8c8c;">(</span>
   stuNo <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">identity</span> <span style="color: #c678dd; font-weight: bold;">primary</span> <span style="color: #c678dd; font-weight: bold;">key</span>,         <span style="color: #687080; font-style: italic;">-- &#20027;&#38190;+&#33258;&#22686;</span>
   stuName <span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>12<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span>,           <span style="color: #687080; font-style: italic;">-- &#38750;&#31354;&#32422;&#26463;</span>
   stuAge <span style="color: #61afef;">int</span>                              <span style="color: #687080; font-style: italic;">-- &#26377;&#38382;&#39064;!!!</span>
     <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span>                              <span style="color: #687080; font-style: italic;">-- &#38750;&#31354;&#32422;&#26463;</span>
     <span style="color: #c678dd; font-weight: bold;">check</span><span style="color: #93a8c6;">(</span>stuAge &gt;= 0 <span style="color: #c678dd; font-weight: bold;">and</span> stuAge &lt;= 100<span style="color: #93a8c6;">)</span>, <span style="color: #687080; font-style: italic;">-- &#26816;&#26597;&#32422;&#26463;</span>
   stuSex <span style="color: #61afef;">nchar</span><span style="color: #93a8c6;">(</span>1<span style="color: #93a8c6;">)</span>
     <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span>                              <span style="color: #687080; font-style: italic;">-- &#38750;&#31354;&#32422;&#26463;</span>
     <span style="color: #c678dd; font-weight: bold;">check</span><span style="color: #93a8c6;">(</span>stuSex = <span style="color: #98be65;">'&#30007;'</span> <span style="color: #c678dd; font-weight: bold;">or</span> stuSex = <span style="color: #98be65;">'&#22899;'</span><span style="color: #93a8c6;">)</span> <span style="color: #687080; font-style: italic;">-- &#26816;&#26597;&#32422;&#26463;</span>
     <span style="color: #c678dd; font-weight: bold;">default</span> <span style="color: #93a8c6;">(</span><span style="color: #98be65;">'&#30007;'</span><span style="color: #93a8c6;">)</span>,                       <span style="color: #687080; font-style: italic;">-- &#40664;&#35748;&#20540;</span>
   stuTel <span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>15<span style="color: #93a8c6;">)</span>,
   stuAddress <span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>50<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">default</span> <span style="color: #93a8c6;">(</span><span style="color: #98be65;">'&#22320;&#22336;&#19981;&#35814;'</span><span style="color: #93a8c6;">)</span>,
   className <span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>12<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span>
<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">go</span>
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">exam</span>
<span style="color: #8c8c8c;">(</span>
  examNo <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">primary</span> <span style="color: #c678dd; font-weight: bold;">key</span> <span style="color: #c678dd; font-weight: bold;">identity</span><span style="color: #93a8c6;">(</span>1, 1<span style="color: #93a8c6;">)</span>,
  stuNo <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">foreign</span> <span style="color: #c678dd; font-weight: bold;">key</span> <span style="color: #c678dd; font-weight: bold;">references</span> stuInfo<span style="color: #93a8c6;">(</span>stuNo<span style="color: #93a8c6;">)</span>,       <span style="color: #687080; font-style: italic;">-- &#22806;&#38190;&#32422;&#26463;</span>
  written <span style="color: #61afef;">float</span> <span style="color: #c678dd; font-weight: bold;">check</span> <span style="color: #93a8c6;">(</span>written &gt;= 0 <span style="color: #c678dd; font-weight: bold;">and</span> written &lt;= 100<span style="color: #93a8c6;">)</span>, <span style="color: #687080; font-style: italic;">-- &#31508;&#35797;</span>
  lab <span style="color: #61afef;">float</span> <span style="color: #c678dd; font-weight: bold;">check</span> <span style="color: #93a8c6;">(</span>lab &gt;= 0 <span style="color: #c678dd; font-weight: bold;">and</span> lab &lt;= 100<span style="color: #93a8c6;">)</span>              <span style="color: #687080; font-style: italic;">-- &#26426;&#35797;</span>
<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">go</span>
</pre>
</div>

<p>
Question:
</p>
<ul class="org-ul">
<li><p>
char/nchar/varchar/nvarchar 类型的区别
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">x</span> <span style="color: #8c8c8c;">(</span>s <span style="color: #61afef;">char</span><span style="color: #93a8c6;">(</span>1<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">y</span> <span style="color: #8c8c8c;">(</span>s <span style="color: #61afef;">nchar</span><span style="color: #93a8c6;">(</span>1<span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> y <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'&#30007;'</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div></li>
<li>GBK/UTF8/UTF16 的区别</li>
<li>什么是外键，它有什么作用，是不是必须的? 外键有哪些添加方式?</li>
</ul>

<p>
小结:
</p>
<ul class="org-ul">
<li>默认情况下，字段的大小写不敏感，可以使用 <code>[xxx]</code> 方式强制其敏感</li>
<li>在数据库中，字段/表名字使用的是下划线分割的命名规则</li>
<li>数据应该是静态的，年龄 (Age) 不适合作为一个字段，用 birth 代替</li>
<li>建议使用 <b>代理主键</b> 代替 <b>自然主键</b>，即主键不应与业务有关</li>
<li><p>
表跟列的命名，有不同风格:
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">student</span> <span style="color: #8c8c8c;">(</span>id, <span style="color: #c678dd; font-weight: bold;">name</span>, tel, addr<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">t_student</span> <span style="color: #8c8c8c;">(</span>stu_id, stu_name, stu_tel, stu_addr<span style="color: #8c8c8c;">)</span>;
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgc034ae3" class="outline-3">
<h3 id="orgc034ae3"><span class="section-number-3">3.3</span> 常见数据类型</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org729861d" class="outline-4">
<h4 id="org729861d"><span class="section-number-4">3.3.1</span> 数值</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
整数:
</p>
<ul class="org-ul">
<li>tinyint</li>
<li>smallint</li>
<li>int</li>
<li>bigint</li>
</ul>

<p>
浮点:
</p>
<ul class="org-ul">
<li>real</li>
<li>float</li>
<li>decimal(5,2)</li>
</ul>

<p>
另外:
</p>
<ul class="org-ul">
<li>smallmoney</li>
<li>money</li>
</ul>
</div>
</div>

<div id="outline-container-org67411c3" class="outline-4">
<h4 id="org67411c3"><span class="section-number-4">3.3.2</span> 字符串</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li>char/nchar</li>
<li>varchar/nvarchar，有存储上限的 8000</li>
<li>text/ntext，表示巨大的存储</li>
</ul>
</div>
</div>

<div id="outline-container-orgdaee19c" class="outline-4">
<h4 id="orgdaee19c"><span class="section-number-4">3.3.3</span> 日期/时间</h4>
<div class="outline-text-4" id="text-3-3-3">
<ul class="org-ul">
<li>date</li>
<li>time</li>
<li>datetime</li>
<li>datetime2</li>
<li>getdate()</li>
</ul>
</div>
</div>

<div id="outline-container-org5c1f978" class="outline-4">
<h4 id="org5c1f978"><span class="section-number-4">3.3.4</span> 其他类型</h4>
<div class="outline-text-4" id="text-3-3-4">
<ul class="org-ul">
<li>image</li>
<li>binary</li>
<li>varbinary</li>
</ul>
</div>
</div>

<div id="outline-container-org3a81d6d" class="outline-4">
<h4 id="org3a81d6d"><span class="section-number-4">3.3.5</span> 使用例子</h4>
<div class="outline-text-4" id="text-3-3-5">
<div class="org-src-container">
<pre class="src src-sql">use xxx;
<span style="color: #c678dd; font-weight: bold;">go</span>
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">xx13</span> <span style="color: #8c8c8c;">(</span>aaa datetime2 <span style="color: #c678dd; font-weight: bold;">default</span> getdate<span style="color: #93a8c6;">()</span>, b <span style="color: #61afef;">int</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> xx13 <span style="color: #8c8c8c;">(</span>b<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span>1<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">go</span>

<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> xx13;
</pre>
</div>
</div>
</div>
</div>
