.src/163/SQLServer/b-sql.org
** table 的修改

基本修改:
#+begin_src sql
  -- 添加字段
  alter table stuinfo add stuEmail varchar(50) not null;

  -- 修改字段
  alter table stuinfo alter column stuname nvarchar(9) not null;

  -- 删除字段
  alter table stuinfo drop column stuEmail;

  -- 约束的添加和删除
  alter table stuinfo add constraint pk_stuno primary key (stuno);
  alter table stuinfo drop constraint pk_stuno;
  alter table stuinfo add constraint fk_stuno foreign key (stuno) references xxx(no);
  alter table stuinfo drop constraint fk_stuno;
#+end_src

** table 的删除

#+begin_src sql
  drop table xxx;
#+end_src

** constraint 的管理

分类:
- 主键约束 (Primary Key)
- 唯一约束 (Unique)
- 检查约束 (Check)
- 默认约束 (Default)
- 外键约束 (Foreign Key)

到底使用外键否? 取决于 *场景* 和 *权衡*。

添加到列上的约束:
#+begin_src sql
  create table demo_constraint
  (
     aaa int primary key,
     bbb int not null,
     ccc int default 1,
     ddd int check (ddd > 5),
     eee int unique,
     fff int references xxx(number)
  );
  -- 如果修改，可以使用 alter table ... alter column ...
#+end_src

表级约束 (建表的时候添加):
#+begin_src sql
  create table demo_constraint
  (
     aaa int,
     bbb int,
     ccc int,
     ddd int,
     eee int,
     fff int,
     [constraint pk_aaa] primary key (aaa),
     [constraint fk_fff] foreign key (fff) references xxx(number)
  );
  alter table demo_constraint drop constraint pk_aaa;
#+end_src

表级约束 (建完表之后添加，在实际中更常用):
#+begin_src sql
  create table demo_constraint
  (
     aaa int,
     bbb int,
     ccc int,
     ddd int,
     eee int,
     fff int
  );
  alter table demo_constraint add constraint pk_aaa primary key (aaa);
  alter table demo_constraint add constraint fk_fff foreign key (fff) references xxx(number);
#+end_src

在实际中，可能要综合使用:
#+begin_src sql
  create table demo_constraint
  (
     aaa int,
     bbb int not null,
     ccc int unique,
     ddd int default 2,
     eee int check (eee > 4),
     fff int,
     primary key (aaa)
  );
  alter table demo_constraint add constraint fk_fff foreign key (fff) references xxx(number);
#+end_src

