html/SQLServer/b-sql.html

<div id="outline-container-org720a383" class="outline-3">
<h3 id="org720a383"><span class="section-number-3">3.4</span> table 的修改</h3>
<div class="outline-text-3" id="text-3-4">
<p>
基本修改:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#28155;&#21152;&#23383;&#27573;</span>
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">stuinfo</span> <span style="color: #c678dd; font-weight: bold;">add</span> stuEmail <span style="color: #61afef;">varchar</span><span style="color: #8c8c8c;">(</span>50<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span>;

<span style="color: #687080; font-style: italic;">-- &#20462;&#25913;&#23383;&#27573;</span>
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">stuinfo</span> <span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">column</span> stuname nvarchar<span style="color: #8c8c8c;">(</span>9<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span>;

<span style="color: #687080; font-style: italic;">-- &#21024;&#38500;&#23383;&#27573;</span>
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">stuinfo</span> <span style="color: #c678dd; font-weight: bold;">drop</span> <span style="color: #c678dd; font-weight: bold;">column</span> stuEmail;

<span style="color: #687080; font-style: italic;">-- &#32422;&#26463;&#30340;&#28155;&#21152;&#21644;&#21024;&#38500;</span>
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">stuinfo</span> <span style="color: #c678dd; font-weight: bold;">add</span> <span style="color: #c678dd; font-weight: bold;">constraint</span> pk_stuno <span style="color: #c678dd; font-weight: bold;">primary</span> <span style="color: #c678dd; font-weight: bold;">key</span> <span style="color: #8c8c8c;">(</span>stuno<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">stuinfo</span> <span style="color: #c678dd; font-weight: bold;">drop</span> <span style="color: #c678dd; font-weight: bold;">constraint</span> pk_stuno;
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">stuinfo</span> <span style="color: #c678dd; font-weight: bold;">add</span> <span style="color: #c678dd; font-weight: bold;">constraint</span> fk_stuno <span style="color: #c678dd; font-weight: bold;">foreign</span> <span style="color: #c678dd; font-weight: bold;">key</span> <span style="color: #8c8c8c;">(</span>stuno<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">references</span> xxx<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">no</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">stuinfo</span> <span style="color: #c678dd; font-weight: bold;">drop</span> <span style="color: #c678dd; font-weight: bold;">constraint</span> fk_stuno;
</pre>
</div>
</div>
</div>

<div id="outline-container-org877b2eb" class="outline-3">
<h3 id="org877b2eb"><span class="section-number-3">3.5</span> table 的删除</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">drop</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">xxx</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf46e263" class="outline-3">
<h3 id="orgf46e263"><span class="section-number-3">3.6</span> constraint 的管理</h3>
<div class="outline-text-3" id="text-3-6">
<p>
分类:
</p>
<ul class="org-ul">
<li>主键约束 (Primary Key)</li>
<li>唯一约束 (Unique)</li>
<li>检查约束 (Check)</li>
<li>默认约束 (Default)</li>
<li>外键约束 (Foreign Key)</li>
</ul>

<p>
到底使用外键否? 取决于 <b>场景</b> 和 <b>权衡</b>。
</p>

<p>
添加到列上的约束:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">demo_constraint</span>
<span style="color: #8c8c8c;">(</span>
   aaa <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">primary</span> <span style="color: #c678dd; font-weight: bold;">key</span>,
   bbb <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span>,
   ccc <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">default</span> 1,
   ddd <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">check</span> <span style="color: #93a8c6;">(</span>ddd &gt; 5<span style="color: #93a8c6;">)</span>,
   eee <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">unique</span>,
   fff <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">references</span> xxx<span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">number</span><span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>;
<span style="color: #687080; font-style: italic;">-- &#22914;&#26524;&#20462;&#25913;&#65292;&#21487;&#20197;&#20351;&#29992; alter table ... alter column ...</span>
</pre>
</div>

<p>
表级约束 (建表的时候添加):
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">demo_constraint</span>
<span style="color: #8c8c8c;">(</span>
   aaa <span style="color: #61afef;">int</span>,
   bbb <span style="color: #61afef;">int</span>,
   ccc <span style="color: #61afef;">int</span>,
   ddd <span style="color: #61afef;">int</span>,
   eee <span style="color: #61afef;">int</span>,
   fff <span style="color: #61afef;">int</span>,
   <span style="color: #93a8c6;">[</span><span style="color: #c678dd; font-weight: bold;">constraint</span> pk_aaa<span style="color: #93a8c6;">]</span> <span style="color: #c678dd; font-weight: bold;">primary</span> <span style="color: #c678dd; font-weight: bold;">key</span> <span style="color: #93a8c6;">(</span>aaa<span style="color: #93a8c6;">)</span>,
   <span style="color: #93a8c6;">[</span><span style="color: #c678dd; font-weight: bold;">constraint</span> fk_fff<span style="color: #93a8c6;">]</span> <span style="color: #c678dd; font-weight: bold;">foreign</span> <span style="color: #c678dd; font-weight: bold;">key</span> <span style="color: #93a8c6;">(</span>fff<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">references</span> xxx<span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">number</span><span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">demo_constraint</span> <span style="color: #c678dd; font-weight: bold;">drop</span> <span style="color: #c678dd; font-weight: bold;">constraint</span> pk_aaa;
</pre>
</div>

<p>
表级约束 (建完表之后添加，在实际中更常用):
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">demo_constraint</span>
<span style="color: #8c8c8c;">(</span>
   aaa <span style="color: #61afef;">int</span>,
   bbb <span style="color: #61afef;">int</span>,
   ccc <span style="color: #61afef;">int</span>,
   ddd <span style="color: #61afef;">int</span>,
   eee <span style="color: #61afef;">int</span>,
   fff <span style="color: #61afef;">int</span>
<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">demo_constraint</span> <span style="color: #c678dd; font-weight: bold;">add</span> <span style="color: #c678dd; font-weight: bold;">constraint</span> pk_aaa <span style="color: #c678dd; font-weight: bold;">primary</span> <span style="color: #c678dd; font-weight: bold;">key</span> <span style="color: #8c8c8c;">(</span>aaa<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">demo_constraint</span> <span style="color: #c678dd; font-weight: bold;">add</span> <span style="color: #c678dd; font-weight: bold;">constraint</span> fk_fff <span style="color: #c678dd; font-weight: bold;">foreign</span> <span style="color: #c678dd; font-weight: bold;">key</span> <span style="color: #8c8c8c;">(</span>fff<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">references</span> xxx<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">number</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div>

<p>
在实际中，可能要综合使用:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">demo_constraint</span>
<span style="color: #8c8c8c;">(</span>
   aaa <span style="color: #61afef;">int</span>,
   bbb <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span>,
   ccc <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">unique</span>,
   ddd <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">default</span> 2,
   eee <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">check</span> <span style="color: #93a8c6;">(</span>eee &gt; 4<span style="color: #93a8c6;">)</span>,
   fff <span style="color: #61afef;">int</span>,
   <span style="color: #c678dd; font-weight: bold;">primary</span> <span style="color: #c678dd; font-weight: bold;">key</span> <span style="color: #93a8c6;">(</span>aaa<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">demo_constraint</span> <span style="color: #c678dd; font-weight: bold;">add</span> <span style="color: #c678dd; font-weight: bold;">constraint</span> fk_fff <span style="color: #c678dd; font-weight: bold;">foreign</span> <span style="color: #c678dd; font-weight: bold;">key</span> <span style="color: #8c8c8c;">(</span>fff<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">references</span> xxx<span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">number</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div>
</div>
</div>
