.src/163/SQLServer/b-sql.org
** insert 插入

基本写法:
#+begin_src sql
  create table zzz (a int, b text, c date);

  -- 按照顺序对应表中的字段 (不推荐)
  insert into zzz values (111, 'abc', '2009-02-13');

  -- 如果发生表的字段增加的情况，上述的语句会出错
  alter table zzz add ddd varchar(20) default ('bossisevil');
  insert into zzz values (111, 'abc', '2009-02-13'); -- 出错
  insert into zzz (a, b, c) values (111, 'abc', '2009-02-13'); -- 正确写法!

  -- 为数据表，增加一个默认插入时间的字段
  alter table zzz add created_at datetime default getdate();
  insert into zzz (a, b, c) values (111, 'abc', '2009-02-13');
  select * from zzz; -- created_at 字段被填充了值
#+end_src

复制表的数据:
#+begin_src sql
  -- 复制表的结果，以及数据
  select * into zzzzz from zzz;

  -- 只是复制数据
  insert into zzzz select * from zzz where ddd is not null;
#+end_src

** delete/truncate 删除

#+begin_src sql
  -- 删除 zzz 中所有数据
  delete from zzz;

  -- 删除 zzz 中部分数据
  delete from zzz where ddd is null;

  -- 删除所有数据
  -- 比 delete 更高效 (不用记录日志)
  -- truncate 不能加条件
  -- 属于 DDL 语句
  -- 坚决要慎用此语句
  truncate table zzz;
#+end_src

** update 更新

#+begin_src sql
  -- 一定不要落下 where 条件
  -- 在更新前，一定先通过 select 确定要修改的数据条目
  update zzz set a = 2 where a = 1;
  update zzz set a = a + 2 where a = 1;
#+end_src

** select 查询
