html/SQLServer/b-sql.html

<div id="outline-container-orged456e4" class="outline-3">
<h3 id="orged456e4"><span class="section-number-3">3.7</span> insert 插入</h3>
<div class="outline-text-3" id="text-3-7">
<p>
基本写法:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">zzz</span> <span style="color: #8c8c8c;">(</span>a <span style="color: #61afef;">int</span>, b text, c <span style="color: #61afef;">date</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#25353;&#29031;&#39034;&#24207;&#23545;&#24212;&#34920;&#20013;&#30340;&#23383;&#27573; (&#19981;&#25512;&#33616;)</span>
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> zzz <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span>111, <span style="color: #98be65;">'abc'</span>, <span style="color: #98be65;">'2009-02-13'</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#22914;&#26524;&#21457;&#29983;&#34920;&#30340;&#23383;&#27573;&#22686;&#21152;&#30340;&#24773;&#20917;&#65292;&#19978;&#36848;&#30340;&#35821;&#21477;&#20250;&#20986;&#38169;</span>
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">zzz</span> <span style="color: #c678dd; font-weight: bold;">add</span> ddd <span style="color: #61afef;">varchar</span><span style="color: #8c8c8c;">(</span>20<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">default</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'bossisevil'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> zzz <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span>111, <span style="color: #98be65;">'abc'</span>, <span style="color: #98be65;">'2009-02-13'</span><span style="color: #8c8c8c;">)</span>; <span style="color: #687080; font-style: italic;">-- &#20986;&#38169;</span>
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> zzz <span style="color: #8c8c8c;">(</span>a, b, c<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span>111, <span style="color: #98be65;">'abc'</span>, <span style="color: #98be65;">'2009-02-13'</span><span style="color: #8c8c8c;">)</span>; <span style="color: #687080; font-style: italic;">-- &#27491;&#30830;&#20889;&#27861;!</span>

<span style="color: #687080; font-style: italic;">-- &#20026;&#25968;&#25454;&#34920;&#65292;&#22686;&#21152;&#19968;&#20010;&#40664;&#35748;&#25554;&#20837;&#26102;&#38388;&#30340;&#23383;&#27573;</span>
<span style="color: #c678dd; font-weight: bold;">alter</span> <span style="color: #c678dd; font-weight: bold;">table</span> zzz <span style="color: #c678dd; font-weight: bold;">add</span> created_at datetime <span style="color: #c678dd; font-weight: bold;">default</span> <span style="color: #61afef;">getdate</span><span style="color: #8c8c8c;">()</span>;
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> zzz <span style="color: #8c8c8c;">(</span>a, b, c<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span>111, <span style="color: #98be65;">'abc'</span>, <span style="color: #98be65;">'2009-02-13'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> zzz; <span style="color: #687080; font-style: italic;">-- created_at &#23383;&#27573;&#34987;&#22635;&#20805;&#20102;&#20540;</span>
</pre>
</div>

<p>
复制表的数据:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#22797;&#21046;&#34920;&#30340;&#32467;&#26524;&#65292;&#20197;&#21450;&#25968;&#25454;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">into</span> zzzzz <span style="color: #c678dd; font-weight: bold;">from</span> zzz;

<span style="color: #687080; font-style: italic;">-- &#21482;&#26159;&#22797;&#21046;&#25968;&#25454;</span>
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> zzzz <span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> zzz <span style="color: #c678dd; font-weight: bold;">where</span> ddd <span style="color: #c678dd; font-weight: bold;">is</span> <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc74556d" class="outline-3">
<h3 id="orgc74556d"><span class="section-number-3">3.8</span> delete/truncate 删除</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#21024;&#38500; zzz &#20013;&#25152;&#26377;&#25968;&#25454;</span>
<span style="color: #c678dd; font-weight: bold;">delete</span> <span style="color: #c678dd; font-weight: bold;">from</span> zzz;

<span style="color: #687080; font-style: italic;">-- &#21024;&#38500; zzz &#20013;&#37096;&#20998;&#25968;&#25454;</span>
<span style="color: #c678dd; font-weight: bold;">delete</span> <span style="color: #c678dd; font-weight: bold;">from</span> zzz <span style="color: #c678dd; font-weight: bold;">where</span> ddd <span style="color: #c678dd; font-weight: bold;">is</span> <span style="color: #c678dd; font-weight: bold;">null</span>;

<span style="color: #687080; font-style: italic;">-- &#21024;&#38500;&#25152;&#26377;&#25968;&#25454;</span>
<span style="color: #687080; font-style: italic;">-- &#27604; delete &#26356;&#39640;&#25928; (&#19981;&#29992;&#35760;&#24405;&#26085;&#24535;)</span>
<span style="color: #687080; font-style: italic;">-- truncate &#19981;&#33021;&#21152;&#26465;&#20214;</span>
<span style="color: #687080; font-style: italic;">-- &#23646;&#20110; DDL &#35821;&#21477;</span>
<span style="color: #687080; font-style: italic;">-- &#22362;&#20915;&#35201;&#24910;&#29992;&#27492;&#35821;&#21477;</span>
truncate <span style="color: #c678dd; font-weight: bold;">table</span> zzz;
</pre>
</div>
</div>
</div>

<div id="outline-container-org92f5321" class="outline-3">
<h3 id="org92f5321"><span class="section-number-3">3.9</span> update 更新</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#19968;&#23450;&#19981;&#35201;&#33853;&#19979; where &#26465;&#20214;</span>
<span style="color: #687080; font-style: italic;">-- &#22312;&#26356;&#26032;&#21069;&#65292;&#19968;&#23450;&#20808;&#36890;&#36807; select &#30830;&#23450;&#35201;&#20462;&#25913;&#30340;&#25968;&#25454;&#26465;&#30446;</span>
<span style="color: #c678dd; font-weight: bold;">update</span> zzz <span style="color: #c678dd; font-weight: bold;">set</span> a = 2 <span style="color: #c678dd; font-weight: bold;">where</span> a = 1;
<span style="color: #c678dd; font-weight: bold;">update</span> zzz <span style="color: #c678dd; font-weight: bold;">set</span> a = a + 2 <span style="color: #c678dd; font-weight: bold;">where</span> a = 1;
</pre>
</div>
</div>
</div>
