html/SQLServer/b-sql.html

<div id="outline-container-org3efb8f5" class="outline-3">
<h3 id="org3efb8f5"><span class="section-number-3">3.10</span> select 查询</h3>
<div class="outline-text-3" id="text-3-10">
</div>
<div id="outline-container-orgc8463eb" class="outline-4">
<h4 id="orgc8463eb"><span class="section-number-4">3.10.1</span> 测试数据</h4>
<div class="outline-text-4" id="text-3-10-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">CREATE</span> DATABASE oa;
use oa;

<span style="color: #c678dd; font-weight: bold;">CREATE</span> <span style="color: #c678dd; font-weight: bold;">TABLE</span> <span style="color: #61afef;">dept</span> <span style="color: #8c8c8c;">(</span> <span style="color: #687080; font-style: italic;">-- department</span>
  deptno <span style="color: #61afef;">int</span>,
  dname  <span style="color: #61afef;">VARCHAR</span><span style="color: #93a8c6;">(</span>14<span style="color: #93a8c6;">)</span>,
  loc    <span style="color: #61afef;">VARCHAR</span><span style="color: #93a8c6;">(</span>13<span style="color: #93a8c6;">)</span>, <span style="color: #687080; font-style: italic;">-- location/address</span>
  <span style="color: #c678dd; font-weight: bold;">CONSTRAINT</span> pk_dept <span style="color: #c678dd; font-weight: bold;">PRIMARY</span> <span style="color: #c678dd; font-weight: bold;">KEY</span> <span style="color: #93a8c6;">(</span>deptno<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">CREATE</span> <span style="color: #c678dd; font-weight: bold;">TABLE</span> <span style="color: #61afef;">emp</span> <span style="color: #8c8c8c;">(</span> <span style="color: #687080; font-style: italic;">-- employee</span>
  empno    <span style="color: #61afef;">int</span>,
  ename    <span style="color: #61afef;">VARCHAR</span><span style="color: #93a8c6;">(</span>10<span style="color: #93a8c6;">)</span>,
  job      <span style="color: #61afef;">VARCHAR</span><span style="color: #93a8c6;">(</span>9<span style="color: #93a8c6;">)</span>,
  mgr      <span style="color: #61afef;">int</span>,
  hiredate <span style="color: #61afef;">DATE</span>,
  sal      <span style="color: #61afef;">float</span>,
  comm     <span style="color: #61afef;">float</span>,
  deptno   <span style="color: #61afef;">int</span>,
  <span style="color: #c678dd; font-weight: bold;">CONSTRAINT</span> pk_emp <span style="color: #c678dd; font-weight: bold;">PRIMARY</span> <span style="color: #c678dd; font-weight: bold;">KEY</span> <span style="color: #93a8c6;">(</span>empno<span style="color: #93a8c6;">)</span>,
  <span style="color: #c678dd; font-weight: bold;">CONSTRAINT</span> fk_deptno <span style="color: #c678dd; font-weight: bold;">FOREIGN</span> <span style="color: #c678dd; font-weight: bold;">KEY</span> <span style="color: #93a8c6;">(</span>deptno<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">REFERENCES</span> dept <span style="color: #93a8c6;">(</span>deptno<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">CREATE</span> <span style="color: #c678dd; font-weight: bold;">TABLE</span> <span style="color: #61afef;">bonus</span> <span style="color: #8c8c8c;">(</span> <span style="color: #687080; font-style: italic;">-- bonus</span>
  ename <span style="color: #61afef;">VARCHAR</span><span style="color: #93a8c6;">(</span>10<span style="color: #93a8c6;">)</span>,
  job   <span style="color: #61afef;">VARCHAR</span><span style="color: #93a8c6;">(</span>9<span style="color: #93a8c6;">)</span>,
  sal   <span style="color: #61afef;">float</span>,
  comm  <span style="color: #61afef;">float</span>
<span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">CREATE</span> <span style="color: #c678dd; font-weight: bold;">TABLE</span> <span style="color: #61afef;">salgrade</span> <span style="color: #8c8c8c;">(</span> <span style="color: #687080; font-style: italic;">-- salary grade</span>
  grade <span style="color: #61afef;">int</span>,
  losal <span style="color: #61afef;">float</span>,
  hisal <span style="color: #61afef;">float</span>
<span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> dept <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span>10, <span style="color: #98be65;">'ACCOUNTING'</span>, <span style="color: #98be65;">'NEW YORK'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> dept <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span>20, <span style="color: #98be65;">'RESEARCH'</span>, <span style="color: #98be65;">'DALLAS'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> dept <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span>30, <span style="color: #98be65;">'SALES'</span>, <span style="color: #98be65;">'CHICAGO'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> dept <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span>40, <span style="color: #98be65;">'OPERATIONS'</span>, <span style="color: #98be65;">'BOSTON'</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7839, <span style="color: #98be65;">'KING'</span>, <span style="color: #98be65;">'PRESIDENT'</span>, <span style="color: #c678dd; font-weight: bold;">null</span>, <span style="color: #98be65;">'1981-11-17'</span>, 5000, <span style="color: #c678dd; font-weight: bold;">null</span>, 10 <span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7698, <span style="color: #98be65;">'BLAKE'</span>, <span style="color: #98be65;">'MANAGER'</span>, 7839, <span style="color: #98be65;">'1981-05-01'</span>, 2850, <span style="color: #c678dd; font-weight: bold;">null</span>, 30<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7782, <span style="color: #98be65;">'CLARK'</span>, <span style="color: #98be65;">'MANAGER'</span>, 7839, <span style="color: #98be65;">'1981-06-09'</span>, 2450, <span style="color: #c678dd; font-weight: bold;">null</span>, 10<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7566, <span style="color: #98be65;">'JONES'</span>, <span style="color: #98be65;">'MANAGER'</span>, 7839, <span style="color: #98be65;">'1981-04-02'</span>, 2975, <span style="color: #c678dd; font-weight: bold;">null</span>, 20<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7788, <span style="color: #98be65;">'SCOTT'</span>, <span style="color: #98be65;">'ANALYST'</span>, 7566, <span style="color: #98be65;">'1987-07-13'</span>, 3000, <span style="color: #c678dd; font-weight: bold;">null</span>, 20<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7902, <span style="color: #98be65;">'FORD'</span>, <span style="color: #98be65;">'ANALYST'</span>, 7566, <span style="color: #98be65;">'1981-12-03'</span>, 3000, <span style="color: #c678dd; font-weight: bold;">null</span>, 20 <span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7369, <span style="color: #98be65;">'SMITH'</span>, <span style="color: #98be65;">'CLERK'</span>, 7902, <span style="color: #98be65;">'1980-12-17'</span>, 800, <span style="color: #c678dd; font-weight: bold;">null</span>, 20 <span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7499, <span style="color: #98be65;">'ALLEN'</span>, <span style="color: #98be65;">'SALESMAN'</span>, 7698, <span style="color: #98be65;">'1981-02-20'</span>, 1600, 300, 30<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7521, <span style="color: #98be65;">'WARD'</span>, <span style="color: #98be65;">'SALESMAN'</span>, 7698, <span style="color: #98be65;">'1981-02-22'</span>, 1250, 500, 30 <span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7654, <span style="color: #98be65;">'MARTIN'</span>, <span style="color: #98be65;">'SALESMAN'</span>, 7698, <span style="color: #98be65;">'1981-09-28'</span>, 1250, 1400, 30 <span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7844, <span style="color: #98be65;">'TURNER'</span>, <span style="color: #98be65;">'SALESMAN'</span>, 7698, <span style="color: #98be65;">'1981-09-08'</span>, 1500, 0, 30<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7876, <span style="color: #98be65;">'ADAMS'</span>, <span style="color: #98be65;">'CLERK'</span>, 7788, <span style="color: #98be65;">'1987-07-13'</span>, 1100, <span style="color: #c678dd; font-weight: bold;">null</span>, 20 <span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7900, <span style="color: #98be65;">'JAMES'</span>, <span style="color: #98be65;">'CLERK'</span>, 7698, <span style="color: #98be65;">'1981-12-03'</span>, 950, <span style="color: #c678dd; font-weight: bold;">null</span>, 30 <span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> emp <span style="color: #c678dd; font-weight: bold;">VALUES</span><span style="color: #8c8c8c;">(</span> 7934, <span style="color: #98be65;">'MILLER'</span>, <span style="color: #98be65;">'CLERK'</span>, 7782, <span style="color: #98be65;">'1982-01-23'</span>, 1300, <span style="color: #c678dd; font-weight: bold;">null</span>, 10 <span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> salgrade <span style="color: #c678dd; font-weight: bold;">VALUES</span> <span style="color: #8c8c8c;">(</span>1, 700, 1200<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> salgrade <span style="color: #c678dd; font-weight: bold;">VALUES</span> <span style="color: #8c8c8c;">(</span>2, 1201, 1400<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> salgrade <span style="color: #c678dd; font-weight: bold;">VALUES</span> <span style="color: #8c8c8c;">(</span>3, 1401, 2000<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> salgrade <span style="color: #c678dd; font-weight: bold;">VALUES</span> <span style="color: #8c8c8c;">(</span>4, 2001, 3000<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">INSERT</span> <span style="color: #c678dd; font-weight: bold;">INTO</span> salgrade <span style="color: #c678dd; font-weight: bold;">VALUES</span> <span style="color: #8c8c8c;">(</span>5, 3001, 9999<span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">go</span>
</pre>
</div>
</div>
</div>
