.src/163/SQLServer/b-sql.org
*** 基本查询

基本句式:
#+begin_src sql
  select 字段们 
    from 表名
    where 条件 or/and/not 其他条件
    group by 组
    having 分组基础上的条件
    order by 排序的依据;
#+end_src

基本使用:
#+begin_src sql
  -- 最简单的查询
  select * from emp;

  -- 指定字段
  select empno, ename from emp;

  -- 添加条件
  select empno, ename, sal, comm from emp where sal < 1500;

  -- 组合条件
  select empno, ename, sal, comm from emp where sal < 1500 and comm is null;
  select empno, ename, sal, comm from emp where (sal < 1500 and comm is null) or sal < 1300;
  select empno, ename, sal, comm from emp where sal + isnull(comm, 0) < 1800;

  -- 使用别名
  select empno, ename, sal - 200 as sal, comm from emp;
  select empno, ename, sal - 200 + isnull(comm, 0) as total_sal from emp;

  -- 进行计算
  select empno,
         ename + ' - ' + job as who,
         sal - 200 + isnull(comm, 0) as total_sal
    from emp;

  -- 进行排序
  select empno,
           ename + ' - ' + job as who,
           sal - 200 + isnull(comm, 0) as total_sal
      from emp
      order by total_sal;

  -- 反向排序
  select empno,
           ename + ' - ' + job as who,
           sal - 200 + isnull(comm, 0) as total_sal
      from emp
      order by total_sal desc; -- Ascending

  -- 多个排序
  select * from emp
    order by sal + isnull(comm, 0) desc,
             hiredate desc;

  -- 结合 where，注意顺序
  select * from emp
    where empno <> 7839
    order by sal + isnull(comm, 0) desc,
             hiredate desc;
#+end_src

统计查询:
#+begin_src sql
  select count(*) from emp;
  select count(1) from emp;     -- 不推荐
  select count(empno) from emp; -- 不推荐

  select max(sal) from emp;
  select min(sal) from emp;
  select avg(sal) from emp where deptno = 20;
#+end_src

快捷方式:
#+begin_src sql
  -- 完全等效，表示区间
  select * from student where score >= 60 and score <= 90;
  select * from student where score between 60 and 90;

  -- 完全等效，表示选项
  select * from student where class='163' or class='165' or class='168';
  select * from student where class in ('163', '165', '168');
  select * from student where class not in ('163', '165', '168');
#+end_src

小结:
- 使用 * 代表所有字段，结果会按照定义的顺序返回
- 使用 count(*) 来统计总数
- 注意 where/group/order-by 的顺序
- 使用 != 或 <> 来表示不等于
- 使用 is null 或 is not null 表示空或非空
- SQLServer 中使用 + 连接字符串

*** 子查询 (subquery)
