html/SQLServer/b-sql.html

<div id="outline-container-orgd6e70bf" class="outline-4">
<h4 id="orgd6e70bf"><span class="section-number-4">3.10.2</span> 基本查询</h4>
<div class="outline-text-4" id="text-3-10-2">
<p>
基本句式:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">select</span> &#23383;&#27573;&#20204;
  <span style="color: #c678dd; font-weight: bold;">from</span> &#34920;&#21517;
  <span style="color: #c678dd; font-weight: bold;">where</span> &#26465;&#20214; <span style="color: #c678dd; font-weight: bold;">or</span>/<span style="color: #c678dd; font-weight: bold;">and</span>/<span style="color: #c678dd; font-weight: bold;">not</span> &#20854;&#20182;&#26465;&#20214;
  <span style="color: #c678dd; font-weight: bold;">group</span> <span style="color: #c678dd; font-weight: bold;">by</span> &#32452;
  <span style="color: #c678dd; font-weight: bold;">having</span> &#20998;&#32452;&#22522;&#30784;&#19978;&#30340;&#26465;&#20214;
  <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> &#25490;&#24207;&#30340;&#20381;&#25454;;
</pre>
</div>

<p>
基本使用:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#26368;&#31616;&#21333;&#30340;&#26597;&#35810;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp;

<span style="color: #687080; font-style: italic;">-- &#25351;&#23450;&#23383;&#27573;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> empno, ename <span style="color: #c678dd; font-weight: bold;">from</span> emp;

<span style="color: #687080; font-style: italic;">-- &#28155;&#21152;&#26465;&#20214;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> empno, ename, sal, comm <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &lt; 1500;

<span style="color: #687080; font-style: italic;">-- &#32452;&#21512;&#26465;&#20214;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> empno, ename, sal, comm <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &lt; 1500 <span style="color: #c678dd; font-weight: bold;">and</span> comm <span style="color: #c678dd; font-weight: bold;">is</span> <span style="color: #c678dd; font-weight: bold;">null</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> empno, ename, sal, comm <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #8c8c8c;">(</span>sal &lt; 1500 <span style="color: #c678dd; font-weight: bold;">and</span> comm <span style="color: #c678dd; font-weight: bold;">is</span> <span style="color: #c678dd; font-weight: bold;">null</span><span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">or</span> sal &lt; 1300;
<span style="color: #c678dd; font-weight: bold;">select</span> empno, ename, sal, comm <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal + isnull<span style="color: #8c8c8c;">(</span>comm, 0<span style="color: #8c8c8c;">)</span> &lt; 1800;

<span style="color: #687080; font-style: italic;">-- &#20351;&#29992;&#21035;&#21517;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> empno, ename, sal - 200 <span style="color: #c678dd; font-weight: bold;">as</span> sal, comm <span style="color: #c678dd; font-weight: bold;">from</span> emp;
<span style="color: #c678dd; font-weight: bold;">select</span> empno, ename, sal - 200 + isnull<span style="color: #8c8c8c;">(</span>comm, 0<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> total_sal <span style="color: #c678dd; font-weight: bold;">from</span> emp;

<span style="color: #687080; font-style: italic;">-- &#36827;&#34892;&#35745;&#31639;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> empno,
       ename + <span style="color: #98be65;">' - '</span> + job <span style="color: #c678dd; font-weight: bold;">as</span> who,
       sal - 200 + isnull<span style="color: #8c8c8c;">(</span>comm, 0<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> total_sal
  <span style="color: #c678dd; font-weight: bold;">from</span> emp;

<span style="color: #687080; font-style: italic;">-- &#36827;&#34892;&#25490;&#24207;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> empno,
         ename + <span style="color: #98be65;">' - '</span> + job <span style="color: #c678dd; font-weight: bold;">as</span> who,
         sal - 200 + isnull<span style="color: #8c8c8c;">(</span>comm, 0<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> total_sal
    <span style="color: #c678dd; font-weight: bold;">from</span> emp
    <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> total_sal;

<span style="color: #687080; font-style: italic;">-- &#21453;&#21521;&#25490;&#24207;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> empno,
         ename + <span style="color: #98be65;">' - '</span> + job <span style="color: #c678dd; font-weight: bold;">as</span> who,
         sal - 200 + isnull<span style="color: #8c8c8c;">(</span>comm, 0<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> total_sal
    <span style="color: #c678dd; font-weight: bold;">from</span> emp
    <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> total_sal <span style="color: #c678dd; font-weight: bold;">desc</span>; <span style="color: #687080; font-style: italic;">-- Ascending</span>

<span style="color: #687080; font-style: italic;">-- &#22810;&#20010;&#25490;&#24207;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> sal + isnull<span style="color: #8c8c8c;">(</span>comm, 0<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">desc</span>,
           hiredate <span style="color: #c678dd; font-weight: bold;">desc</span>;

<span style="color: #687080; font-style: italic;">-- &#32467;&#21512; where&#65292;&#27880;&#24847;&#39034;&#24207;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> empno &lt;&gt; 7839
  <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> sal + isnull<span style="color: #8c8c8c;">(</span>comm, 0<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">desc</span>,
           hiredate <span style="color: #c678dd; font-weight: bold;">desc</span>;
</pre>
</div>

<p>
统计查询:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">count</span><span style="color: #8c8c8c;">(</span>*<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp;
<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">count</span><span style="color: #8c8c8c;">(</span>1<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp;     <span style="color: #687080; font-style: italic;">-- &#19981;&#25512;&#33616;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">count</span><span style="color: #8c8c8c;">(</span>empno<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp; <span style="color: #687080; font-style: italic;">-- &#19981;&#25512;&#33616;</span>

<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">max</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp;
<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">min</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp;
<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">avg</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> deptno = 20;
</pre>
</div>

<p>
快捷方式:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#23436;&#20840;&#31561;&#25928;&#65292;&#34920;&#31034;&#21306;&#38388;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student <span style="color: #c678dd; font-weight: bold;">where</span> score &gt;= 60 <span style="color: #c678dd; font-weight: bold;">and</span> score &lt;= 90;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student <span style="color: #c678dd; font-weight: bold;">where</span> score <span style="color: #c678dd; font-weight: bold;">between</span> 60 <span style="color: #c678dd; font-weight: bold;">and</span> 90;

<span style="color: #687080; font-style: italic;">-- &#23436;&#20840;&#31561;&#25928;&#65292;&#34920;&#31034;&#36873;&#39033;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">class</span>=<span style="color: #98be65;">'163'</span> <span style="color: #c678dd; font-weight: bold;">or</span> <span style="color: #c678dd; font-weight: bold;">class</span>=<span style="color: #98be65;">'165'</span> <span style="color: #c678dd; font-weight: bold;">or</span> <span style="color: #c678dd; font-weight: bold;">class</span>=<span style="color: #98be65;">'168'</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">class</span> <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'163'</span>, <span style="color: #98be65;">'165'</span>, <span style="color: #98be65;">'168'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">class</span> <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'163'</span>, <span style="color: #98be65;">'165'</span>, <span style="color: #98be65;">'168'</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div>

<p>
小结:
</p>
<ul class="org-ul">
<li>使用 * 代表所有字段，结果会按照定义的顺序返回</li>
<li>使用 count(*) 来统计总数</li>
<li>注意 where/group/order-by 的顺序</li>
<li>使用 != 或 &lt;&gt; 来表示不等于</li>
<li>使用 is null 或 is not null 表示空或非空</li>
<li>SQLServer 中使用 + 连接字符串</li>
</ul>
</div>
</div>
