.src/163/SQLServer/b-sql.org
**** 作为临时表存在

#+begin_src sql
  -- 实际上，就是内存中的临时表
  select ename, job from (
      select * from emp where sal > 2000
    ) as a1
    where sal < 5000;

  -- 疯狂模式
  select ename from (
    select ename from (
      select ename from (
        select ename from (
          select ename, job from (
            select * from emp where sal > 2000
          ) as a1
          where sal < 5000)
        as a2 )
      as a3)
    as a4)
  as a5;
#+end_src

**** 作为字段存在

#+begin_src sql
  select empno, ename,
         job, sal, comm,
         deptno,
         sal - (select avg(sal) from emp) as chaju -- 单行单字段
     from emp
     order by job;
#+end_src

