html/SQLServer/b-sql.html

<div id="outline-container-org29881c2" class="outline-4">
<h4 id="org29881c2"><span class="section-number-4">3.10.3</span> 子查询 (subquery)</h4>
<div class="outline-text-4" id="text-3-10-3">
</div>
<div id="outline-container-org87076c8" class="outline-5">
<h5 id="org87076c8"><span class="section-number-5">3.10.3.1</span> 作为临时表存在</h5>
<div class="outline-text-5" id="text-3-10-3-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#23454;&#38469;&#19978;&#65292;&#23601;&#26159;&#20869;&#23384;&#20013;&#30340;&#20020;&#26102;&#34920;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> ename, job <span style="color: #c678dd; font-weight: bold;">from</span> <span style="color: #8c8c8c;">(</span>
    <span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &gt; 2000
  <span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> a1
  <span style="color: #c678dd; font-weight: bold;">where</span> sal &lt; 5000;

<span style="color: #687080; font-style: italic;">-- &#30127;&#29378;&#27169;&#24335;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> ename <span style="color: #c678dd; font-weight: bold;">from</span> <span style="color: #8c8c8c;">(</span>
  <span style="color: #c678dd; font-weight: bold;">select</span> ename <span style="color: #c678dd; font-weight: bold;">from</span> <span style="color: #93a8c6;">(</span>
    <span style="color: #c678dd; font-weight: bold;">select</span> ename <span style="color: #c678dd; font-weight: bold;">from</span> <span style="color: #b0b1a3;">(</span>
      <span style="color: #c678dd; font-weight: bold;">select</span> ename <span style="color: #c678dd; font-weight: bold;">from</span> <span style="color: #97b098;">(</span>
        <span style="color: #c678dd; font-weight: bold;">select</span> ename, job <span style="color: #c678dd; font-weight: bold;">from</span> <span style="color: #aebed8;">(</span>
          <span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &gt; 2000
        <span style="color: #aebed8;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> a1
        <span style="color: #c678dd; font-weight: bold;">where</span> sal &lt; 5000<span style="color: #97b098;">)</span>
      <span style="color: #c678dd; font-weight: bold;">as</span> a2 <span style="color: #b0b1a3;">)</span>
    <span style="color: #c678dd; font-weight: bold;">as</span> a3<span style="color: #93a8c6;">)</span>
  <span style="color: #c678dd; font-weight: bold;">as</span> a4<span style="color: #8c8c8c;">)</span>
<span style="color: #c678dd; font-weight: bold;">as</span> a5;
</pre>
</div>
</div>
</div>

<div id="outline-container-org65a4a8f" class="outline-5">
<h5 id="org65a4a8f"><span class="section-number-5">3.10.3.2</span> 作为字段存在</h5>
<div class="outline-text-5" id="text-3-10-3-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">select</span> empno, ename,
       job, sal, comm,
       deptno,
       sal - <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">avg</span><span style="color: #93a8c6;">(</span>sal<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> chaju <span style="color: #687080; font-style: italic;">-- &#21333;&#34892;&#21333;&#23383;&#27573;</span>
   <span style="color: #c678dd; font-weight: bold;">from</span> emp
   <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> job;
</pre>
</div>
</div>
</div>
