.src/163/SQLServer/b-sql.org
**** 作为条件存在

基本使用:
#+begin_src sql
  -- 查询所有工资拖后腿的人

  -- 首先，我们查:
  --   select * from emp;
  -- 其次，要过滤，工资低
  --   select * from emp where sal < ?;
  -- 然后，少于多少呢？平均工资
  --   select avg(sal) from emp;
  -- 最后，结合起来:
  select * from emp where sal < (select avg(sal) from emp);

  -- 增强版: 实际收入拖后腿
  select * from emp 
    where sal + ISNULL(comm,0) < (select AVG(sal +ISNULL(comm,0)) from emp);

  -- 查询所有的非 ANALYST 中工资比 ANALYST 最低工资还高的人
  -- 查询所有[的[非 ANALYST 中][工资比 [ANALYST 最低工资]还高]]的人
  -- 步骤拆解:
  -- 1. 最低工资是多少?
  select min(sal) from emp where job = 'ANALYST';
  -- 2. 过滤第一步: 非 ANALYST
  select * from emp where job <> 'ANALYST';
  -- 3. 过滤第二步: 工资比 ? 高
  select * from emp where sal > (select min(sal) from emp where job = 'ANALYST');
  -- 4. 整合所有
  select * from emp
    where job <> 'ANALYST'
      and sal > (select min(sal) from emp where job = 'ANALYST');
#+end_src

IN 语句:
#+begin_src sql
  -- 使用 in 结合 subquery 将条件动态化 (多行单列)
  select * from student where class in (163, 165, 169);
  select * from student where class in (select classname from class);

  -- 请您查找所有 Research 部门的人
  select * from emp;          -- 悲催的是，emp 表中没有 dname 字段; 欣喜的是，它有 deptno 字段
  select * from dept where dname = 'RESEARCH'; -- 通过这步，可以得到 RESEARCH 部门的编号为 20
  select * from emp where deptno = 20;         -- 结合上一步，筛选出符合条件的人即可

  -- 查找所有的人; 其 deptno 属于 dept 表中 dname 为 Research 的那些 dept
  select * from emp where deptno in (select deptno from dept where dname = 'RESEARCH');

  -- 增强版: 查找所有 RESEARCH 部门还有在 BOSTON 工作的人
  select * from emp where deptno in (select deptno from dept where dname = 'RESEARCH' or loc = 'BOSTON');

  -- 增强版: 查找所有 RESEARCH 部门还有在 BOSTON 工作的，并且工资等级为 4 或 5 的人
  -- 断句: 查找所有[( RESEARCH 部门还有在 BOSTON 工作的)，并且(工资等级为 4 或 5 的)]人
  select * from emp
    where deptno in (select deptno from dept where dname = 'RESEARCH' or loc = 'BOSTON')
      and sal >= 2001;
  -- 使用 subquery 动态化
  select * from emp
    where deptno in (select deptno from dept where dname = 'RESEARCH' or loc = 'BOSTON')
      and sal >= (select losal from salgrade where grade = 4);
  -- 让事情更细致
  select * from emp
    where deptno in (select deptno from dept where dname = 'RESEARCH' or loc = 'BOSTON')
      and sal between (select losal from salgrade where grade = 4)
                  and (select hisal from salgrade where grade = 5);
#+end_src

EXISTS 语句:
#+begin_src sql
  -- 下面两句功能上是等效的
  select * from emp
    where deptno in (select deptno from dept where loc = 'CHICAGO');
  select * from emp
    where exists (select * from dept where emp.deptno = dept.deptno 
                                       and dept.loc = 'CHICAGO');
  -- 性能比较 (脑补)
  select * from student where cardid in (select id from renkou where shengfen='广东');
  select * from student where exists (select id from renkou where renkou.id = student.cardid and shenfen = '广东');
  select * from student s where exists (select id from renkou r where r.id = s.cardid and r.shenfen = '广东');
#+end_src

ALL/ANY/SOME 语句:
#+begin_src sql
  select * from student s
    where stuno = any(select stuno from exam e where written >= 60 and lab >= 60);

  select * from student s
    where stuno in (select stuno from exam e where written >= 60 and lab >= 60);

  select * from student s
    where exists (select * from exam e where s.stuno = e.stuno and e.written >= 60 and e.lab >= 60);

  create table t1 (n int);
  create table t2 (n int);
  insert into t1 values (2), (3);
  insert into t2 values (1), (2), (3), (4);
  select * from t2 where n > all(select * from t1);   -- 4
  select * from t2 where n > some(select * from t1);  -- 3, 4
#+end_src

小结:
- 很多人不愿意用 exists，而是喜欢用 in，因为 in 更容易理解并且语句更简短
- 实际上，更推荐使用 exists，因为在很多场合 exists 更有效率
  #+begin_src sql
    -- 高额的空间占用
    -- 巨大的对比次数
    select * from student where cardid in (select id from renkoubiao where shengfen='广东');
  #+end_src
- ANY/SOME/ALL 是 exists 的语法糖，在某些场景之下，更加直观

