html/SQLServer/b-sql.html

<div id="outline-container-org0d52b07" class="outline-5">
<h5 id="org0d52b07"><span class="section-number-5">3.10.3.3</span> 作为条件存在</h5>
<div class="outline-text-5" id="text-3-10-3-3">
<p>
基本使用:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#26597;&#35810;&#25152;&#26377;&#24037;&#36164;&#25302;&#21518;&#33151;&#30340;&#20154;</span>

<span style="color: #687080; font-style: italic;">-- &#39318;&#20808;&#65292;&#25105;&#20204;&#26597;:</span>
<span style="color: #687080; font-style: italic;">--   select * from emp;</span>
<span style="color: #687080; font-style: italic;">-- &#20854;&#27425;&#65292;&#35201;&#36807;&#28388;&#65292;&#24037;&#36164;&#20302;</span>
<span style="color: #687080; font-style: italic;">--   select * from emp where sal &lt; ?;</span>
<span style="color: #687080; font-style: italic;">-- &#28982;&#21518;&#65292;&#23569;&#20110;&#22810;&#23569;&#21602;&#65311;&#24179;&#22343;&#24037;&#36164;</span>
<span style="color: #687080; font-style: italic;">--   select avg(sal) from emp;</span>
<span style="color: #687080; font-style: italic;">-- &#26368;&#21518;&#65292;&#32467;&#21512;&#36215;&#26469;:</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &lt; <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">avg</span><span style="color: #93a8c6;">(</span>sal<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp<span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#22686;&#24378;&#29256;: &#23454;&#38469;&#25910;&#20837;&#25302;&#21518;&#33151;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> sal + ISNULL<span style="color: #8c8c8c;">(</span>comm,0<span style="color: #8c8c8c;">)</span> &lt; <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">AVG</span><span style="color: #93a8c6;">(</span>sal +ISNULL<span style="color: #b0b1a3;">(</span>comm,0<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp<span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#26597;&#35810;&#25152;&#26377;&#30340;&#38750; ANALYST &#20013;&#24037;&#36164;&#27604; ANALYST &#26368;&#20302;&#24037;&#36164;&#36824;&#39640;&#30340;&#20154;</span>
<span style="color: #687080; font-style: italic;">-- &#26597;&#35810;&#25152;&#26377;[&#30340;[&#38750; ANALYST &#20013;][&#24037;&#36164;&#27604; [ANALYST &#26368;&#20302;&#24037;&#36164;]&#36824;&#39640;]]&#30340;&#20154;</span>
<span style="color: #687080; font-style: italic;">-- &#27493;&#39588;&#25286;&#35299;:</span>
<span style="color: #687080; font-style: italic;">-- 1. &#26368;&#20302;&#24037;&#36164;&#26159;&#22810;&#23569;?</span>
<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">min</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> job = <span style="color: #98be65;">'ANALYST'</span>;
<span style="color: #687080; font-style: italic;">-- 2. &#36807;&#28388;&#31532;&#19968;&#27493;: &#38750; ANALYST</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> job &lt;&gt; <span style="color: #98be65;">'ANALYST'</span>;
<span style="color: #687080; font-style: italic;">-- 3. &#36807;&#28388;&#31532;&#20108;&#27493;: &#24037;&#36164;&#27604; ? &#39640;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &gt; <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">min</span><span style="color: #93a8c6;">(</span>sal<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> job = <span style="color: #98be65;">'ANALYST'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #687080; font-style: italic;">-- 4. &#25972;&#21512;&#25152;&#26377;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> job &lt;&gt; <span style="color: #98be65;">'ANALYST'</span>
    <span style="color: #c678dd; font-weight: bold;">and</span> sal &gt; <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">min</span><span style="color: #93a8c6;">(</span>sal<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> job = <span style="color: #98be65;">'ANALYST'</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div>

<p>
IN 语句:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#20351;&#29992; in &#32467;&#21512; subquery &#23558;&#26465;&#20214;&#21160;&#24577;&#21270; (&#22810;&#34892;&#21333;&#21015;)</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">class</span> <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span>163, 165, 169<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">class</span> <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> classname <span style="color: #c678dd; font-weight: bold;">from</span> <span style="color: #c678dd; font-weight: bold;">class</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#35831;&#24744;&#26597;&#25214;&#25152;&#26377; Research &#37096;&#38376;&#30340;&#20154;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp;          <span style="color: #687080; font-style: italic;">-- &#24754;&#20652;&#30340;&#26159;&#65292;emp &#34920;&#20013;&#27809;&#26377; dname &#23383;&#27573;; &#27427;&#21916;&#30340;&#26159;&#65292;&#23427;&#26377; deptno &#23383;&#27573;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> dname = <span style="color: #98be65;">'RESEARCH'</span>; <span style="color: #687080; font-style: italic;">-- &#36890;&#36807;&#36825;&#27493;&#65292;&#21487;&#20197;&#24471;&#21040; RESEARCH &#37096;&#38376;&#30340;&#32534;&#21495;&#20026; 20</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> deptno = 20;         <span style="color: #687080; font-style: italic;">-- &#32467;&#21512;&#19978;&#19968;&#27493;&#65292;&#31579;&#36873;&#20986;&#31526;&#21512;&#26465;&#20214;&#30340;&#20154;&#21363;&#21487;</span>

<span style="color: #687080; font-style: italic;">-- &#26597;&#25214;&#25152;&#26377;&#30340;&#20154;; &#20854; deptno &#23646;&#20110; dept &#34920;&#20013; dname &#20026; Research &#30340;&#37027;&#20123; dept</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> deptno <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> dname = <span style="color: #98be65;">'RESEARCH'</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#22686;&#24378;&#29256;: &#26597;&#25214;&#25152;&#26377; RESEARCH &#37096;&#38376;&#36824;&#26377;&#22312; BOSTON &#24037;&#20316;&#30340;&#20154;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> deptno <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> dname = <span style="color: #98be65;">'RESEARCH'</span> <span style="color: #c678dd; font-weight: bold;">or</span> loc = <span style="color: #98be65;">'BOSTON'</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#22686;&#24378;&#29256;: &#26597;&#25214;&#25152;&#26377; RESEARCH &#37096;&#38376;&#36824;&#26377;&#22312; BOSTON &#24037;&#20316;&#30340;&#65292;&#24182;&#19988;&#24037;&#36164;&#31561;&#32423;&#20026; 4 &#25110; 5 &#30340;&#20154;</span>
<span style="color: #687080; font-style: italic;">-- &#26029;&#21477;: &#26597;&#25214;&#25152;&#26377;[( RESEARCH &#37096;&#38376;&#36824;&#26377;&#22312; BOSTON &#24037;&#20316;&#30340;)&#65292;&#24182;&#19988;(&#24037;&#36164;&#31561;&#32423;&#20026; 4 &#25110; 5 &#30340;)]&#20154;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> deptno <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> dname = <span style="color: #98be65;">'RESEARCH'</span> <span style="color: #c678dd; font-weight: bold;">or</span> loc = <span style="color: #98be65;">'BOSTON'</span><span style="color: #8c8c8c;">)</span>
    <span style="color: #c678dd; font-weight: bold;">and</span> sal &gt;= 2001;
<span style="color: #687080; font-style: italic;">-- &#20351;&#29992; subquery &#21160;&#24577;&#21270;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> deptno <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> dname = <span style="color: #98be65;">'RESEARCH'</span> <span style="color: #c678dd; font-weight: bold;">or</span> loc = <span style="color: #98be65;">'BOSTON'</span><span style="color: #8c8c8c;">)</span>
    <span style="color: #c678dd; font-weight: bold;">and</span> sal &gt;= <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> losal <span style="color: #c678dd; font-weight: bold;">from</span> salgrade <span style="color: #c678dd; font-weight: bold;">where</span> grade = 4<span style="color: #8c8c8c;">)</span>;
<span style="color: #687080; font-style: italic;">-- &#35753;&#20107;&#24773;&#26356;&#32454;&#33268;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> deptno <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> dname = <span style="color: #98be65;">'RESEARCH'</span> <span style="color: #c678dd; font-weight: bold;">or</span> loc = <span style="color: #98be65;">'BOSTON'</span><span style="color: #8c8c8c;">)</span>
    <span style="color: #c678dd; font-weight: bold;">and</span> sal <span style="color: #c678dd; font-weight: bold;">between</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> losal <span style="color: #c678dd; font-weight: bold;">from</span> salgrade <span style="color: #c678dd; font-weight: bold;">where</span> grade = 4<span style="color: #8c8c8c;">)</span>
                <span style="color: #c678dd; font-weight: bold;">and</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> hisal <span style="color: #c678dd; font-weight: bold;">from</span> salgrade <span style="color: #c678dd; font-weight: bold;">where</span> grade = 5<span style="color: #8c8c8c;">)</span>;
</pre>
</div>

<p>
EXISTS 语句:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#19979;&#38754;&#20004;&#21477;&#21151;&#33021;&#19978;&#26159;&#31561;&#25928;&#30340;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> deptno <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> loc = <span style="color: #98be65;">'CHICAGO'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">exists</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> emp.deptno = dept.deptno
                                     <span style="color: #c678dd; font-weight: bold;">and</span> dept.loc = <span style="color: #98be65;">'CHICAGO'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #687080; font-style: italic;">-- &#24615;&#33021;&#27604;&#36739; (&#33041;&#34917;)</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student <span style="color: #c678dd; font-weight: bold;">where</span> cardid <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> id <span style="color: #c678dd; font-weight: bold;">from</span> renkou <span style="color: #c678dd; font-weight: bold;">where</span> shengfen=<span style="color: #98be65;">'&#24191;&#19996;'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">exists</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> id <span style="color: #c678dd; font-weight: bold;">from</span> renkou <span style="color: #c678dd; font-weight: bold;">where</span> renkou.id = student.cardid <span style="color: #c678dd; font-weight: bold;">and</span> shenfen = <span style="color: #98be65;">'&#24191;&#19996;'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student s <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">exists</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> id <span style="color: #c678dd; font-weight: bold;">from</span> renkou r <span style="color: #c678dd; font-weight: bold;">where</span> r.id = s.cardid <span style="color: #c678dd; font-weight: bold;">and</span> r.shenfen = <span style="color: #98be65;">'&#24191;&#19996;'</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div>

<p>
ALL/ANY/SOME 语句:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student s
  <span style="color: #c678dd; font-weight: bold;">where</span> stuno = <span style="color: #c678dd; font-weight: bold;">any</span><span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> stuno <span style="color: #c678dd; font-weight: bold;">from</span> exam e <span style="color: #c678dd; font-weight: bold;">where</span> written &gt;= 60 <span style="color: #c678dd; font-weight: bold;">and</span> lab &gt;= 60<span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student s
  <span style="color: #c678dd; font-weight: bold;">where</span> stuno <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> stuno <span style="color: #c678dd; font-weight: bold;">from</span> exam e <span style="color: #c678dd; font-weight: bold;">where</span> written &gt;= 60 <span style="color: #c678dd; font-weight: bold;">and</span> lab &gt;= 60<span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student s
  <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">exists</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> exam e <span style="color: #c678dd; font-weight: bold;">where</span> s.stuno = e.stuno <span style="color: #c678dd; font-weight: bold;">and</span> e.written &gt;= 60 <span style="color: #c678dd; font-weight: bold;">and</span> e.lab &gt;= 60<span style="color: #8c8c8c;">)</span>;

<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">t1</span> <span style="color: #8c8c8c;">(</span>n <span style="color: #61afef;">int</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">t2</span> <span style="color: #8c8c8c;">(</span>n <span style="color: #61afef;">int</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> t1 <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span>2<span style="color: #8c8c8c;">)</span>, <span style="color: #8c8c8c;">(</span>3<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> t2 <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span>1<span style="color: #8c8c8c;">)</span>, <span style="color: #8c8c8c;">(</span>2<span style="color: #8c8c8c;">)</span>, <span style="color: #8c8c8c;">(</span>3<span style="color: #8c8c8c;">)</span>, <span style="color: #8c8c8c;">(</span>4<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> t2 <span style="color: #c678dd; font-weight: bold;">where</span> n &gt; <span style="color: #c678dd; font-weight: bold;">all</span><span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> t1<span style="color: #8c8c8c;">)</span>;   <span style="color: #687080; font-style: italic;">-- 4</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> t2 <span style="color: #c678dd; font-weight: bold;">where</span> n &gt; <span style="color: #c678dd; font-weight: bold;">some</span><span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> t1<span style="color: #8c8c8c;">)</span>;  <span style="color: #687080; font-style: italic;">-- 3, 4</span>
</pre>
</div>

<p>
小结:
</p>
<ul class="org-ul">
<li>很多人不愿意用 exists，而是喜欢用 in，因为 in 更容易理解并且语句更简短</li>
<li><p>
实际上，更推荐使用 exists，因为在很多场合 exists 更有效率
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#39640;&#39069;&#30340;&#31354;&#38388;&#21344;&#29992;</span>
<span style="color: #687080; font-style: italic;">-- &#24040;&#22823;&#30340;&#23545;&#27604;&#27425;&#25968;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> student <span style="color: #c678dd; font-weight: bold;">where</span> cardid <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> id <span style="color: #c678dd; font-weight: bold;">from</span> renkoubiao <span style="color: #c678dd; font-weight: bold;">where</span> shengfen=<span style="color: #98be65;">'&#24191;&#19996;'</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div></li>
<li>ANY/SOME/ALL 是 exists 的语法糖，在某些场景之下，更加直观</li>
</ul>
</div>
</div>
