.src/163/SQLServer/b-sql.org
**** 阶段性作业 (subquery)

查询出芝加哥工作的工资最高的人的上司的工资，超出平均工资的数目:
#+begin_src sql
  -- 查询芝加哥工作的所有人
  select * from emp
    where deptno = (select deptno from dept where loc = 'CHICAGO');

  -- 查询芝加哥工资最高的那个人
  -- 分解题目:
  -- 1. 定位到芝加哥城市的部门编号 (select deptno from dept where loc = 'CHICAGO');
  -- 2. 查找所有在芝加哥工作的人 (根据上述的部门编号) (select * from emp where deptno = ?);
  -- 3. 计算所有芝加哥工作的人的最高工资 (select max(sal) from emp where deptno = ?);
  -- 4. 获取工资最高的人的信息 (select * from emp where deptno = ? and sal = ?);
  select * from emp
    where deptno = (select deptno from dept where loc = 'CHICAGO')
      and sal = (select max(sal) from emp where deptno = (select deptno from dept where loc = 'CHICAGO'));
  -- 借助排序和 top 进行实现
  select top 1 * from emp
    where deptno = (select deptno from dept where loc = 'CHICAGO')
    order by sal desc;

  -- 查询芝加哥工资最高的那个人的上司
  select * from emp
    where empno = (select top 1 mgr from emp
                     where deptno = (select deptno from dept where loc = 'CHICAGO')
                     order by sal desc);

  -- 查询芝加哥工资最高的那个人的上司工资跟平均工资的差距
  select *, sal - (select AVG(sal) from emp) as chaju from emp
    where empno = (select top 1 mgr from emp
                     where deptno = (select deptno from dept where loc = 'CHICAGO')
                     order by sal desc);
#+end_src

