html/SQLServer/b-sql.html

<div id="outline-container-org608f6a7" class="outline-5">
<h5 id="org608f6a7"><span class="section-number-5">3.10.3.4</span> 阶段性作业 (subquery)</h5>
<div class="outline-text-5" id="text-3-10-3-4">
<p>
查询出芝加哥工作的工资最高的人的上司的工资，超出平均工资的数目:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#26597;&#35810;&#33437;&#21152;&#21733;&#24037;&#20316;&#30340;&#25152;&#26377;&#20154;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> deptno = <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> loc = <span style="color: #98be65;">'CHICAGO'</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#26597;&#35810;&#33437;&#21152;&#21733;&#24037;&#36164;&#26368;&#39640;&#30340;&#37027;&#20010;&#20154;</span>
<span style="color: #687080; font-style: italic;">-- &#20998;&#35299;&#39064;&#30446;:</span>
<span style="color: #687080; font-style: italic;">-- 1. &#23450;&#20301;&#21040;&#33437;&#21152;&#21733;&#22478;&#24066;&#30340;&#37096;&#38376;&#32534;&#21495; (select deptno from dept where loc = 'CHICAGO');</span>
<span style="color: #687080; font-style: italic;">-- 2. &#26597;&#25214;&#25152;&#26377;&#22312;&#33437;&#21152;&#21733;&#24037;&#20316;&#30340;&#20154; (&#26681;&#25454;&#19978;&#36848;&#30340;&#37096;&#38376;&#32534;&#21495;) (select * from emp where deptno = ?);</span>
<span style="color: #687080; font-style: italic;">-- 3. &#35745;&#31639;&#25152;&#26377;&#33437;&#21152;&#21733;&#24037;&#20316;&#30340;&#20154;&#30340;&#26368;&#39640;&#24037;&#36164; (select max(sal) from emp where deptno = ?);</span>
<span style="color: #687080; font-style: italic;">-- 4. &#33719;&#21462;&#24037;&#36164;&#26368;&#39640;&#30340;&#20154;&#30340;&#20449;&#24687; (select * from emp where deptno = ? and sal = ?);</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> deptno = <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> loc = <span style="color: #98be65;">'CHICAGO'</span><span style="color: #8c8c8c;">)</span>
    <span style="color: #c678dd; font-weight: bold;">and</span> sal = <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">max</span><span style="color: #93a8c6;">(</span>sal<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> deptno = <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> loc = <span style="color: #98be65;">'CHICAGO'</span><span style="color: #93a8c6;">)</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #687080; font-style: italic;">-- &#20511;&#21161;&#25490;&#24207;&#21644; top &#36827;&#34892;&#23454;&#29616;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> top 1 * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> deptno = <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> loc = <span style="color: #98be65;">'CHICAGO'</span><span style="color: #8c8c8c;">)</span>
  <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> sal <span style="color: #c678dd; font-weight: bold;">desc</span>;

<span style="color: #687080; font-style: italic;">-- &#26597;&#35810;&#33437;&#21152;&#21733;&#24037;&#36164;&#26368;&#39640;&#30340;&#37027;&#20010;&#20154;&#30340;&#19978;&#21496;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> empno = <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> top 1 mgr <span style="color: #c678dd; font-weight: bold;">from</span> emp
                   <span style="color: #c678dd; font-weight: bold;">where</span> deptno = <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> loc = <span style="color: #98be65;">'CHICAGO'</span><span style="color: #93a8c6;">)</span>
                   <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> sal <span style="color: #c678dd; font-weight: bold;">desc</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#26597;&#35810;&#33437;&#21152;&#21733;&#24037;&#36164;&#26368;&#39640;&#30340;&#37027;&#20010;&#20154;&#30340;&#19978;&#21496;&#24037;&#36164;&#36319;&#24179;&#22343;&#24037;&#36164;&#30340;&#24046;&#36317;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> *, sal - <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #61afef; font-weight: bold;">AVG</span><span style="color: #93a8c6;">(</span>sal<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> chaju <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> empno = <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> top 1 mgr <span style="color: #c678dd; font-weight: bold;">from</span> emp
                   <span style="color: #c678dd; font-weight: bold;">where</span> deptno = <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> loc = <span style="color: #98be65;">'CHICAGO'</span><span style="color: #93a8c6;">)</span>
                   <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> sal <span style="color: #c678dd; font-weight: bold;">desc</span><span style="color: #8c8c8c;">)</span>;
</pre>
</div>
</div>
</div>
</div>
