.src/163/SQLServer/b-sql.org
*** 连接查询 (join)

- emp
  + ename
  + sal
  + deptno
- dept
  + deptno
  + dname
  + loc

这其实是三种解决问题的思路:
#+begin_src sql
  ---- 查询出所有在芝加哥工作的员工

  -- 1. 我的编号，在你的编号之内
  select * from emp
    where deptno in (select deptno from dept where loc='xxx');

  -- 2. 我的数据，要逐条跟你的比对，逐步过滤
  select * from emp e
    where exists (select * from dept d where d.deptno = e.deptno and d.loc = 'xxx');

  -- 3. 先拉你创建临时表，再考虑条件的事
  select * from emp
     join dept on emp.deptno = dept.deptno
     where loc = 'CHICAGO' or dname = 'RESEARCH';
#+end_src

查找所有 Research 部门的人:
#+begin_src sql
  -- 根据所有条件创建一个临时表
  select a.*,b.dname,b.loc from emp a
     join dept b on a.deptno = b.deptno and b.dname='Research';

  -- 先创立一张临时表然后根据条件进行筛选
  select a.*,b.dname,b.loc from emp a
     join dept b on a.deptno = b.deptno
     where b.dname='Research';

  -- 非规范方式
  select * from emp e, dept d
     where e.deptno = d.deptno and d.dname = 'Research';
#+end_src

左、右、全连接 (Left/Right/Full Join):
#+begin_src sql
  -- 示例数据
  create table t_student
  (
    id int identity primary key,
    name varchar(200),
    classname varchar(200)
  );
  create table t_class
  (
    classname varchar(200),
    loc varchar(200)
  );
  insert into t_class
         values ('163', '201'),
                ('164', '202'),
                ('165', '404');
  insert into t_student (name, classname)
         values ('zhangsan', '164'),
                ('lisi', '165'),
                ('wangwu', '165'),
                ('zhaoliu', '165'),
                ('sunqi', '');

  -- 查找所有学生，以及他的班级
  select * from t_student s
    join t_class c on s.classname = c.classname;
  select * from t_student s
    [inner] join t_class c on s.classname = c.classname;
  select * from t_student s
    [left] join t_class c on s.classname = c.classname;
  select * from t_student s
    [right] join t_class c on s.classname = c.classname;
  select * from t_student s
    [full] join t_class c on s.classname = c.classname;
#+end_src

笛卡儿积 (叉乘):
#+begin_src sql
  -- 形成的数据是没有意思的，因为很多数据是不对的
  -- 但是，它却是其它有意义的连接的内在基础  
  select * from emp, dept;
  select * from emp 
    [cross] join dept;
#+end_src

