html/SQLServer/b-sql.html

<div id="outline-container-org01b2625" class="outline-4">
<h4 id="org01b2625"><span class="section-number-4">3.10.4</span> 连接查询 (join)</h4>
<div class="outline-text-4" id="text-3-10-4">
<ul class="org-ul">
<li>emp
<ul class="org-ul">
<li>ename</li>
<li>sal</li>
<li>deptno</li>
</ul></li>
<li>dept
<ul class="org-ul">
<li>deptno</li>
<li>dname</li>
<li>loc</li>
</ul></li>
</ul>

<p>
这其实是三种解决问题的思路:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">---- &#26597;&#35810;&#20986;&#25152;&#26377;&#22312;&#33437;&#21152;&#21733;&#24037;&#20316;&#30340;&#21592;&#24037;</span>

<span style="color: #687080; font-style: italic;">-- 1. &#25105;&#30340;&#32534;&#21495;&#65292;&#22312;&#20320;&#30340;&#32534;&#21495;&#20043;&#20869;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> deptno <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> deptno <span style="color: #c678dd; font-weight: bold;">from</span> dept <span style="color: #c678dd; font-weight: bold;">where</span> loc=<span style="color: #98be65;">'xxx'</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- 2. &#25105;&#30340;&#25968;&#25454;&#65292;&#35201;&#36880;&#26465;&#36319;&#20320;&#30340;&#27604;&#23545;&#65292;&#36880;&#27493;&#36807;&#28388;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp e
  <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #c678dd; font-weight: bold;">exists</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> dept d <span style="color: #c678dd; font-weight: bold;">where</span> d.deptno = e.deptno <span style="color: #c678dd; font-weight: bold;">and</span> d.loc = <span style="color: #98be65;">'xxx'</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- 3. &#20808;&#25289;&#20320;&#21019;&#24314;&#20020;&#26102;&#34920;&#65292;&#20877;&#32771;&#34385;&#26465;&#20214;&#30340;&#20107;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
   <span style="color: #c678dd; font-weight: bold;">join</span> dept <span style="color: #c678dd; font-weight: bold;">on</span> emp.deptno = dept.deptno
   <span style="color: #c678dd; font-weight: bold;">where</span> loc = <span style="color: #98be65;">'CHICAGO'</span> <span style="color: #c678dd; font-weight: bold;">or</span> dname = <span style="color: #98be65;">'RESEARCH'</span>;
</pre>
</div>

<p>
查找所有 Research 部门的人:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#26681;&#25454;&#25152;&#26377;&#26465;&#20214;&#21019;&#24314;&#19968;&#20010;&#20020;&#26102;&#34920;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> a.*,b.dname,b.loc <span style="color: #c678dd; font-weight: bold;">from</span> emp a
   <span style="color: #c678dd; font-weight: bold;">join</span> dept b <span style="color: #c678dd; font-weight: bold;">on</span> a.deptno = b.deptno <span style="color: #c678dd; font-weight: bold;">and</span> b.dname=<span style="color: #98be65;">'Research'</span>;

<span style="color: #687080; font-style: italic;">-- &#20808;&#21019;&#31435;&#19968;&#24352;&#20020;&#26102;&#34920;&#28982;&#21518;&#26681;&#25454;&#26465;&#20214;&#36827;&#34892;&#31579;&#36873;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> a.*,b.dname,b.loc <span style="color: #c678dd; font-weight: bold;">from</span> emp a
   <span style="color: #c678dd; font-weight: bold;">join</span> dept b <span style="color: #c678dd; font-weight: bold;">on</span> a.deptno = b.deptno
   <span style="color: #c678dd; font-weight: bold;">where</span> b.dname=<span style="color: #98be65;">'Research'</span>;

<span style="color: #687080; font-style: italic;">-- &#38750;&#35268;&#33539;&#26041;&#24335;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp e, dept d
   <span style="color: #c678dd; font-weight: bold;">where</span> e.deptno = d.deptno <span style="color: #c678dd; font-weight: bold;">and</span> d.dname = <span style="color: #98be65;">'Research'</span>;
</pre>
</div>

<p>
左、右、全连接 (Left/Right/Full Join):
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#31034;&#20363;&#25968;&#25454;</span>
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">t_student</span>
<span style="color: #8c8c8c;">(</span>
  id <span style="color: #61afef;">int</span> <span style="color: #c678dd; font-weight: bold;">identity</span> <span style="color: #c678dd; font-weight: bold;">primary</span> <span style="color: #c678dd; font-weight: bold;">key</span>,
  <span style="color: #c678dd; font-weight: bold;">name</span> <span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>200<span style="color: #93a8c6;">)</span>,
  classname <span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>200<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #c678dd; font-weight: bold;">table</span> <span style="color: #61afef;">t_class</span>
<span style="color: #8c8c8c;">(</span>
  classname <span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>200<span style="color: #93a8c6;">)</span>,
  loc <span style="color: #61afef;">varchar</span><span style="color: #93a8c6;">(</span>200<span style="color: #93a8c6;">)</span>
<span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> t_class
       <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'163'</span>, <span style="color: #98be65;">'201'</span><span style="color: #8c8c8c;">)</span>,
              <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'164'</span>, <span style="color: #98be65;">'202'</span><span style="color: #8c8c8c;">)</span>,
              <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'165'</span>, <span style="color: #98be65;">'404'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> t_student <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">name</span>, classname<span style="color: #8c8c8c;">)</span>
       <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'zhangsan'</span>, <span style="color: #98be65;">'164'</span><span style="color: #8c8c8c;">)</span>,
              <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'lisi'</span>, <span style="color: #98be65;">'165'</span><span style="color: #8c8c8c;">)</span>,
              <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'wangwu'</span>, <span style="color: #98be65;">'165'</span><span style="color: #8c8c8c;">)</span>,
              <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'zhaoliu'</span>, <span style="color: #98be65;">'165'</span><span style="color: #8c8c8c;">)</span>,
              <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'sunqi'</span>, <span style="color: #98be65;">''</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#26597;&#25214;&#25152;&#26377;&#23398;&#29983;&#65292;&#20197;&#21450;&#20182;&#30340;&#29677;&#32423;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> t_student s
  <span style="color: #c678dd; font-weight: bold;">join</span> t_class c <span style="color: #c678dd; font-weight: bold;">on</span> s.classname = c.classname;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> t_student s
  <span style="color: #8c8c8c;">[</span><span style="color: #c678dd; font-weight: bold;">inner</span><span style="color: #8c8c8c;">]</span> <span style="color: #c678dd; font-weight: bold;">join</span> t_class c <span style="color: #c678dd; font-weight: bold;">on</span> s.classname = c.classname;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> t_student s
  <span style="color: #8c8c8c;">[</span><span style="color: #c678dd; font-weight: bold;">left</span><span style="color: #8c8c8c;">]</span> <span style="color: #c678dd; font-weight: bold;">join</span> t_class c <span style="color: #c678dd; font-weight: bold;">on</span> s.classname = c.classname;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> t_student s
  <span style="color: #8c8c8c;">[</span><span style="color: #c678dd; font-weight: bold;">right</span><span style="color: #8c8c8c;">]</span> <span style="color: #c678dd; font-weight: bold;">join</span> t_class c <span style="color: #c678dd; font-weight: bold;">on</span> s.classname = c.classname;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> t_student s
  <span style="color: #8c8c8c;">[</span><span style="color: #c678dd; font-weight: bold;">full</span><span style="color: #8c8c8c;">]</span> <span style="color: #c678dd; font-weight: bold;">join</span> t_class c <span style="color: #c678dd; font-weight: bold;">on</span> s.classname = c.classname;
</pre>
</div>

<p>
笛卡儿积 (叉乘):
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#24418;&#25104;&#30340;&#25968;&#25454;&#26159;&#27809;&#26377;&#24847;&#24605;&#30340;&#65292;&#22240;&#20026;&#24456;&#22810;&#25968;&#25454;&#26159;&#19981;&#23545;&#30340;</span>
<span style="color: #687080; font-style: italic;">-- &#20294;&#26159;&#65292;&#23427;&#21364;&#26159;&#20854;&#23427;&#26377;&#24847;&#20041;&#30340;&#36830;&#25509;&#30340;&#20869;&#22312;&#22522;&#30784;  </span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp, dept;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #8c8c8c;">[</span><span style="color: #c678dd; font-weight: bold;">cross</span><span style="color: #8c8c8c;">]</span> <span style="color: #c678dd; font-weight: bold;">join</span> dept;
</pre>
</div>
</div>
</div>
