.src/163/SQLServer/b-sql.org
*** 合并 (union)

Union 可以连接一切，有意义的，还有无意义的。

#+begin_src sql
  -- 毫无意义（？）的 Union
  select empno from emp
  union
  select deptno, dname from dept;

  -- 稍微有点意义的 Union
  -- 将所有学生和员工都列出来
  select name from t_student
  union
  select ename from emp;

  -- 也可以连接自身表
  select * from emp where sal > 2000 or sal < 1000;
  select * from emp where sal > 2000
  union
  select * from emp where sal < 1000;
#+end_src

*** 分组、窗口查询 (group by/over)

#+begin_src sql
  -- 可以使用 union 手动分组
  select 10, avg(sal) from emp where deptno = 10
  union
  select 20, avg(sal) from emp where deptno = 20
  union
  select 30, avg(sal) from emp where deptno = 30;

  -- 使用分组来简化语句。数据库内部的实现逻辑跟上述 union 版本类似
  select deptno, AVG(sal), MAX(sal), MIN(sal) from emp 
    group by deptno;

  -- 如果想基于分完的组进行过滤，下面写法是 **错的**
  select deptno, AVG(sal) as a, MAX(sal) as d, MIN(sal) as x from emp 
    group by deptno
    where AVG(sal) > 1000;

  -- 可以使用子查询的形式，解决
  select * from 
  ( select deptno, AVG(sal) as a, MAX(sal) as d, MIN(sal) as x from emp 
          where mgr is not null
          group by deptno
  ) as v where a > 2000;
  
  -- 上述写法虽然有效，可是并不够简洁，于是有了 having 关键词
  -- having 是跟 group by 搭配的 `where`
  -- 于是 where -> group by -> having
  -- 先过滤，再分组，再在分组结果的基础上过滤
  select deptno, AVG(sal) as a, MAX(sal) as d, MIN(sal) as x from emp 
    where mgr is not null
    group by deptno
    having AVG(sal) > 2000;
#+end_src

查询所有部门最高工资的人:
#+begin_src sql
  select * from
    (select row_number() over (partition by deptno order by sal desc) as rn, * from emp) as s
    where rn = 1;

  select * from
    (select rank() over (partition by deptno order by sal desc) as rn, * from emp) as s
    where rn = 1;
#+end_src

