html/SQLServer/b-sql.html

<div id="outline-container-org218a752" class="outline-4">
<h4 id="org218a752"><span class="section-number-4">3.10.5</span> 合并 (union)</h4>
<div class="outline-text-4" id="text-3-10-5">
<p>
Union 可以连接一切，有意义的，还有无意义的。
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#27627;&#26080;&#24847;&#20041;&#65288;&#65311;&#65289;&#30340; Union</span>
<span style="color: #c678dd; font-weight: bold;">select</span> empno <span style="color: #c678dd; font-weight: bold;">from</span> emp
<span style="color: #c678dd; font-weight: bold;">union</span>
<span style="color: #c678dd; font-weight: bold;">select</span> deptno, dname <span style="color: #c678dd; font-weight: bold;">from</span> dept;

<span style="color: #687080; font-style: italic;">-- &#31245;&#24494;&#26377;&#28857;&#24847;&#20041;&#30340; Union</span>
<span style="color: #687080; font-style: italic;">-- &#23558;&#25152;&#26377;&#23398;&#29983;&#21644;&#21592;&#24037;&#37117;&#21015;&#20986;&#26469;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #c678dd; font-weight: bold;">name</span> <span style="color: #c678dd; font-weight: bold;">from</span> t_student
<span style="color: #c678dd; font-weight: bold;">union</span>
<span style="color: #c678dd; font-weight: bold;">select</span> ename <span style="color: #c678dd; font-weight: bold;">from</span> emp;

<span style="color: #687080; font-style: italic;">-- &#20063;&#21487;&#20197;&#36830;&#25509;&#33258;&#36523;&#34920;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &gt; 2000 <span style="color: #c678dd; font-weight: bold;">or</span> sal &lt; 1000;
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &gt; 2000
<span style="color: #c678dd; font-weight: bold;">union</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> sal &lt; 1000;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6e82e17" class="outline-4">
<h4 id="org6e82e17"><span class="section-number-4">3.10.6</span> 分组、窗口查询 (group by/over)</h4>
<div class="outline-text-4" id="text-3-10-6">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#21487;&#20197;&#20351;&#29992; union &#25163;&#21160;&#20998;&#32452;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> 10, <span style="color: #61afef; font-weight: bold;">avg</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> deptno = 10
<span style="color: #c678dd; font-weight: bold;">union</span>
<span style="color: #c678dd; font-weight: bold;">select</span> 20, <span style="color: #61afef; font-weight: bold;">avg</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> deptno = 20
<span style="color: #c678dd; font-weight: bold;">union</span>
<span style="color: #c678dd; font-weight: bold;">select</span> 30, <span style="color: #61afef; font-weight: bold;">avg</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">where</span> deptno = 30;

<span style="color: #687080; font-style: italic;">-- &#20351;&#29992;&#20998;&#32452;&#26469;&#31616;&#21270;&#35821;&#21477;&#12290;&#25968;&#25454;&#24211;&#20869;&#37096;&#30340;&#23454;&#29616;&#36923;&#36753;&#36319;&#19978;&#36848; union &#29256;&#26412;&#31867;&#20284;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> deptno, <span style="color: #61afef; font-weight: bold;">AVG</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span>, <span style="color: #61afef; font-weight: bold;">MAX</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span>, <span style="color: #61afef; font-weight: bold;">MIN</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">group</span> <span style="color: #c678dd; font-weight: bold;">by</span> deptno;

<span style="color: #687080; font-style: italic;">-- &#22914;&#26524;&#24819;&#22522;&#20110;&#20998;&#23436;&#30340;&#32452;&#36827;&#34892;&#36807;&#28388;&#65292;&#19979;&#38754;&#20889;&#27861;&#26159; **&#38169;&#30340;**</span>
<span style="color: #c678dd; font-weight: bold;">select</span> deptno, <span style="color: #61afef; font-weight: bold;">AVG</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> a, <span style="color: #61afef; font-weight: bold;">MAX</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> d, <span style="color: #61afef; font-weight: bold;">MIN</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> x <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">group</span> <span style="color: #c678dd; font-weight: bold;">by</span> deptno
  <span style="color: #c678dd; font-weight: bold;">where</span> <span style="color: #61afef; font-weight: bold;">AVG</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> &gt; 1000;

<span style="color: #687080; font-style: italic;">-- &#21487;&#20197;&#20351;&#29992;&#23376;&#26597;&#35810;&#30340;&#24418;&#24335;&#65292;&#35299;&#20915;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span>
<span style="color: #8c8c8c;">(</span> <span style="color: #c678dd; font-weight: bold;">select</span> deptno, <span style="color: #61afef; font-weight: bold;">AVG</span><span style="color: #93a8c6;">(</span>sal<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> a, <span style="color: #61afef; font-weight: bold;">MAX</span><span style="color: #93a8c6;">(</span>sal<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> d, <span style="color: #61afef; font-weight: bold;">MIN</span><span style="color: #93a8c6;">(</span>sal<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> x <span style="color: #c678dd; font-weight: bold;">from</span> emp
        <span style="color: #c678dd; font-weight: bold;">where</span> mgr <span style="color: #c678dd; font-weight: bold;">is</span> <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span>
        <span style="color: #c678dd; font-weight: bold;">group</span> <span style="color: #c678dd; font-weight: bold;">by</span> deptno
<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> v <span style="color: #c678dd; font-weight: bold;">where</span> a &gt; 2000;

<span style="color: #687080; font-style: italic;">-- &#19978;&#36848;&#20889;&#27861;&#34429;&#28982;&#26377;&#25928;&#65292;&#21487;&#26159;&#24182;&#19981;&#22815;&#31616;&#27905;&#65292;&#20110;&#26159;&#26377;&#20102; having &#20851;&#38190;&#35789;</span>
<span style="color: #687080; font-style: italic;">-- having &#26159;&#36319; group by &#25645;&#37197;&#30340; `where`</span>
<span style="color: #687080; font-style: italic;">-- &#20110;&#26159; where -&gt; group by -&gt; having</span>
<span style="color: #687080; font-style: italic;">-- &#20808;&#36807;&#28388;&#65292;&#20877;&#20998;&#32452;&#65292;&#20877;&#22312;&#20998;&#32452;&#32467;&#26524;&#30340;&#22522;&#30784;&#19978;&#36807;&#28388;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> deptno, <span style="color: #61afef; font-weight: bold;">AVG</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> a, <span style="color: #61afef; font-weight: bold;">MAX</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> d, <span style="color: #61afef; font-weight: bold;">MIN</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> x <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> mgr <span style="color: #c678dd; font-weight: bold;">is</span> <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">null</span>
  <span style="color: #c678dd; font-weight: bold;">group</span> <span style="color: #c678dd; font-weight: bold;">by</span> deptno
  <span style="color: #c678dd; font-weight: bold;">having</span> <span style="color: #61afef; font-weight: bold;">AVG</span><span style="color: #8c8c8c;">(</span>sal<span style="color: #8c8c8c;">)</span> &gt; 2000;
</pre>
</div>

<p>
查询所有部门最高工资的人:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> row_number<span style="color: #93a8c6;">()</span> over <span style="color: #93a8c6;">(</span>partition <span style="color: #c678dd; font-weight: bold;">by</span> deptno <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> sal <span style="color: #c678dd; font-weight: bold;">desc</span><span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> rn, * <span style="color: #c678dd; font-weight: bold;">from</span> emp<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> s
  <span style="color: #c678dd; font-weight: bold;">where</span> rn = 1;

<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> rank<span style="color: #93a8c6;">()</span> over <span style="color: #93a8c6;">(</span>partition <span style="color: #c678dd; font-weight: bold;">by</span> deptno <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> sal <span style="color: #c678dd; font-weight: bold;">desc</span><span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> rn, * <span style="color: #c678dd; font-weight: bold;">from</span> emp<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> s
  <span style="color: #c678dd; font-weight: bold;">where</span> rn = 1;
</pre>
</div>
</div>
</div>
