.src/163/SQLServer/b-sql.org
*** 分页查询 (top/row_number/fetch-offset)

只拿出分数据。

最经典的分页语句 (top):
#+begin_src sql
  select top 2 * from emp;

  -- 2 - 4
  -- 1. 前 4 行
  -- 2. 反向
  -- 3. 前两条
  -- 4. 反向
  select * from (select top 3 * from (select top 4 * from emp order by empno) as t order by empno desc) as x order by empno desc;

  -- 另一种思路
  select top 3 * from emp
    where empno not in (select top 1 empno from emp order by empno);

  -- 其他数据库对比
  select * from emp limit 3 offset 4; -- mysql/sqlite/postgresql
  select * from (select *, rownum as rn from emp) rn between 3 and 5; -- oracle
#+end_src

借助窗口函数进行选取 (*row_number*):
#+begin_src sql
  select * from 
     (select row_number() over (order by empno) as rn, * from emp) as s
     where rn between 2 and 5;
#+end_src

SQLServer 2012 以后，开始支持标准的 fetch-offset 写法:
#+begin_src sql
  select * from emp fetch next 5 rows offset 4 rows only order by empno;
#+end_src

** Transaction 事务
*** 什么是事务 (ACID)

#+begin_quote
要么都成，否则都不成。
#+end_quote

事务有哪些属性 (ACID, 酸) *[这是一个非常常见的面试题]*:
1. Atomicity (原子性)
2. Consistency (一致性) 结果上
3. Isolation (隔离性) 并发访问
4. Durability (持久性)

*** 事务的状态

- 活动状态 (active)
- 部分提交状态 (partially committed)
- 失败/中止/提交 (failed/abort/commit)

*** SQLServer 中的事务

首先，默认情况下，SQLServer 中每条语句都会被自动提交。
也就是，任何语句都是一个单独事务，不需要加 commit:
#+begin_src sql
  insert into x values ('xxx');
  -- 这里不需要加 commit 就能插入成功
#+end_src

但是，上述行为存在非常严重的安全隐患，建议关掉。
然后，需要手动使用 commit/rollback 进行事务的终结:
#+begin_src sql
  -- 关闭自动提交
  set implicit_transactions off;

  -- 因此，所有的语句都会在同一个事务中
  insert into x values ('aaa');
  insert into x values ('zzz');

  -- 除非你调用了 commit/rollback 否则上述的语句都不会真正入库
  commit/rollback;
#+end_src

另外，如果你想更精细控制事务的范围，可以使用显式的 begin 语句:
#+begin_src sql
  begin transaction
    insert into x values ('222');
    insert into x values ('212', 2);
    insert into x values ('232');
  commit transaction;
#+end_src

* MySQL 中的 SQL 语句
** create

** 分页
