html/SQLServer/b-sql.html

<div id="outline-container-orge2b8533" class="outline-4">
<h4 id="orge2b8533"><span class="section-number-4">3.10.7</span> 分页查询 (top/row_number/fetch-offset)</h4>
<div class="outline-text-4" id="text-3-10-7">
<p>
只拿出分数据。
</p>

<p>
最经典的分页语句 (top):
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">select</span> top 2 * <span style="color: #c678dd; font-weight: bold;">from</span> emp;

<span style="color: #687080; font-style: italic;">-- 2 - 4</span>
<span style="color: #687080; font-style: italic;">-- 1. &#21069; 4 &#34892;</span>
<span style="color: #687080; font-style: italic;">-- 2. &#21453;&#21521;</span>
<span style="color: #687080; font-style: italic;">-- 3. &#21069;&#20004;&#26465;</span>
<span style="color: #687080; font-style: italic;">-- 4. &#21453;&#21521;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> top 3 * <span style="color: #c678dd; font-weight: bold;">from</span> <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> top 4 * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> empno<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> t <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> empno <span style="color: #c678dd; font-weight: bold;">desc</span><span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> x <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> empno <span style="color: #c678dd; font-weight: bold;">desc</span>;

<span style="color: #687080; font-style: italic;">-- &#21478;&#19968;&#31181;&#24605;&#36335;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> top 3 * <span style="color: #c678dd; font-weight: bold;">from</span> emp
  <span style="color: #c678dd; font-weight: bold;">where</span> empno <span style="color: #c678dd; font-weight: bold;">not</span> <span style="color: #c678dd; font-weight: bold;">in</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> top 1 empno <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> empno<span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#20854;&#20182;&#25968;&#25454;&#24211;&#23545;&#27604;</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">limit</span> 3 offset 4; <span style="color: #687080; font-style: italic;">-- mysql/sqlite/postgresql</span>
<span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> *, rownum <span style="color: #c678dd; font-weight: bold;">as</span> rn <span style="color: #c678dd; font-weight: bold;">from</span> emp<span style="color: #8c8c8c;">)</span> rn <span style="color: #c678dd; font-weight: bold;">between</span> 3 <span style="color: #c678dd; font-weight: bold;">and</span> 5; <span style="color: #687080; font-style: italic;">-- oracle</span>
</pre>
</div>

<p>
借助窗口函数进行选取 (<b>row_number</b>):
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span>
   <span style="color: #8c8c8c;">(</span><span style="color: #c678dd; font-weight: bold;">select</span> row_number<span style="color: #93a8c6;">()</span> over <span style="color: #93a8c6;">(</span><span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> empno<span style="color: #93a8c6;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> rn, * <span style="color: #c678dd; font-weight: bold;">from</span> emp<span style="color: #8c8c8c;">)</span> <span style="color: #c678dd; font-weight: bold;">as</span> s
   <span style="color: #c678dd; font-weight: bold;">where</span> rn <span style="color: #c678dd; font-weight: bold;">between</span> 2 <span style="color: #c678dd; font-weight: bold;">and</span> 5;
</pre>
</div>

<p>
SQLServer 2012 以后，开始支持标准的 fetch-offset 写法:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">select</span> * <span style="color: #c678dd; font-weight: bold;">from</span> emp <span style="color: #c678dd; font-weight: bold;">fetch</span> <span style="color: #c678dd; font-weight: bold;">next</span> 5 <span style="color: #c678dd; font-weight: bold;">rows</span> offset 4 <span style="color: #c678dd; font-weight: bold;">rows</span> <span style="color: #c678dd; font-weight: bold;">only</span> <span style="color: #c678dd; font-weight: bold;">order</span> <span style="color: #c678dd; font-weight: bold;">by</span> empno;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1e8cf5e" class="outline-3">
<h3 id="org1e8cf5e"><span class="section-number-3">3.11</span> Transaction 事务</h3>
<div class="outline-text-3" id="text-3-11">
</div>
<div id="outline-container-orge1f76bd" class="outline-4">
<h4 id="orge1f76bd"><span class="section-number-4">3.11.1</span> 什么是事务 (ACID)</h4>
<div class="outline-text-4" id="text-3-11-1">
<blockquote>
<p>
要么都成，否则都不成。
</p>
</blockquote>

<p>
事务有哪些属性 (ACID, 酸) <b>[这是一个非常常见的面试题]</b>:
</p>
<ol class="org-ol">
<li>Atomicity (原子性)</li>
<li>Consistency (一致性) 结果上</li>
<li>Isolation (隔离性) 并发访问</li>
<li>Durability (持久性)</li>
</ol>
</div>
</div>

<div id="outline-container-orgfcae39c" class="outline-4">
<h4 id="orgfcae39c"><span class="section-number-4">3.11.2</span> 事务的状态</h4>
<div class="outline-text-4" id="text-3-11-2">
<ul class="org-ul">
<li>活动状态 (active)</li>
<li>部分提交状态 (partially committed)</li>
<li>失败/中止/提交 (failed/abort/commit)</li>
</ul>
</div>
</div>

<div id="outline-container-orge19d094" class="outline-4">
<h4 id="orge19d094"><span class="section-number-4">3.11.3</span> SQLServer 中的事务</h4>
<div class="outline-text-4" id="text-3-11-3">
<p>
首先，默认情况下，SQLServer 中每条语句都会被自动提交。
也就是，任何语句都是一个单独事务，不需要加 commit:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> x <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'xxx'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #687080; font-style: italic;">-- &#36825;&#37324;&#19981;&#38656;&#35201;&#21152; commit &#23601;&#33021;&#25554;&#20837;&#25104;&#21151;</span>
</pre>
</div>

<p>
但是，上述行为存在非常严重的安全隐患，建议关掉。
然后，需要手动使用 commit/rollback 进行事务的终结:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #687080; font-style: italic;">-- &#20851;&#38381;&#33258;&#21160;&#25552;&#20132;</span>
<span style="color: #c678dd; font-weight: bold;">set</span> implicit_transactions <span style="color: #c678dd; font-weight: bold;">off</span>;

<span style="color: #687080; font-style: italic;">-- &#22240;&#27492;&#65292;&#25152;&#26377;&#30340;&#35821;&#21477;&#37117;&#20250;&#22312;&#21516;&#19968;&#20010;&#20107;&#21153;&#20013;</span>
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> x <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'aaa'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> x <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'zzz'</span><span style="color: #8c8c8c;">)</span>;

<span style="color: #687080; font-style: italic;">-- &#38500;&#38750;&#20320;&#35843;&#29992;&#20102; commit/rollback &#21542;&#21017;&#19978;&#36848;&#30340;&#35821;&#21477;&#37117;&#19981;&#20250;&#30495;&#27491;&#20837;&#24211;</span>
<span style="color: #c678dd; font-weight: bold;">commit</span>/<span style="color: #c678dd; font-weight: bold;">rollback</span>;
</pre>
</div>

<p>
另外，如果你想更精细控制事务的范围，可以使用显式的 begin 语句:
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">begin</span> <span style="color: #c678dd; font-weight: bold;">transaction</span>
  <span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> x <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'222'</span><span style="color: #8c8c8c;">)</span>;
  <span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> x <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'212'</span>, 2<span style="color: #8c8c8c;">)</span>;
  <span style="color: #c678dd; font-weight: bold;">insert</span> <span style="color: #c678dd; font-weight: bold;">into</span> x <span style="color: #c678dd; font-weight: bold;">values</span> <span style="color: #8c8c8c;">(</span><span style="color: #98be65;">'232'</span><span style="color: #8c8c8c;">)</span>;
<span style="color: #c678dd; font-weight: bold;">commit</span> <span style="color: #c678dd; font-weight: bold;">transaction</span>;
</pre>
</div>
</div>
</div>
</div>
</section>

<section id="outline-container-orgd10ac06" class="outline-2">
<h2 id="orgd10ac06"><span class="section-number-2">4</span> MySQL 中的 SQL 语句</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgf78308e" class="outline-3">
<h3 id="orgf78308e"><span class="section-number-3">4.1</span> create</h3>
</div>

<div id="outline-container-orgc4d55d6" class="outline-3">
<h3 id="orgc4d55d6"><span class="section-number-3">4.2</span> 分页</h3>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2021-01-22</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
